var testStructure = {
  "tests":[
    {
      "testId":0,
      "caption":"final_test",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            // {
            //   "question":"Определите, какая задача соответствует определенному типу менеджмента:",
            //   "score":-1,
            //   "status":"notanswered",
            //   "type": "single",
            //   "answers":[]
            // },
            {
              "question":"Какие роли менеджера относятся к межличностным?",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"Лицо организации",
                  "right": true
                },
                {
                  "label": "Связной",
                  "right": true
                },
                {
                  "label": "Лидер",
                  "right": true
                },
                {
                  "label": "Приемник информации",
                  "right": false
                },
                {
                  "label": "Представитель",
                  "right": false
                },
                {
                  "label": "Предприниматель",
                  "right": false
                },
                {
                  "label": "Устранитель нарушений",
                  "right": false
                }]
            },
            {
              "question":"Отметьте информационные роли менеджера.",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"Лицо организации",
                  "right": false
                },
                {
                  "label": "Лидер",
                  "right": false
                },
                {
                  "label": "Приемник информации",
                  "right": true
                },
                {
                  "label": "Передатчик информации",
                  "right": true
                },
                {
                  "label": "Представитель",
                  "right": false
                },
                {
                  "label": "Предприниматель",
                  "right": false
                },
                {
                  "label": "Распределитель ресурсов",
                  "right": false
                },
                {
                  "label": "Переговорщик",
                  "right": false
                }]
            },
            {
              "question":"Выберите роли менеджера по принятию решений.",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"Лидер",
                  "right": false
                },
                {
                  "label": "Приемник информации",
                  "right": false
                },
                {
                  "label": "Представитель",
                  "right": false
                },
                {
                  "label": "Предприниматель",
                  "right": true
                },
                {
                  "label": "Устранитель нарушений",
                  "right": true
                },
                {
                  "label": "Распределитель ресурсов",
                  "right": true
                },
                {
                  "label": "Переговорщик",
                  "right": true
                }]
            },
            // {
            //   "question":"Впишите в управленческий цикл функции управления.",
            //   "score":-1,
            //   "status":"notanswered",
            //   "type": "single",
            //   "answers":[]
            // },
            // {
            //   "question":"Заполните пробелы (или «раскройте скобки»)",
            //   "score":-1,
            //   "status":"notanswered",
            //   "type": "single",
            //   "answers":[]
            // },
            {
              "question":"Правильно сформулированная цель должна иметь семь характеристик: быть достижимой, четкой, ограниченной во времени, сформулированной письменно, актуальной... Дополните список двумя недостающими характеристиками.",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "измеримой",
                  "right": true
                },
                {
                  "label": "абстрактной",
                  "right": false
                },
                {
                  "label":"проверенной",
                  "right": false
                },
                {
                  "label": "мобилизующей",
                  "right": true
                },
                {
                  "label": "тонизирующей",
                  "right": false
                }
                ]
            },
            {
              "question":"При реализации системы управления по целям устанавливают цели для выполнения работы и развития:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"руководители",
                  "right": false
                },
                {
                  "label": "руководители совместно с подчиненными",
                  "right": true
                },
                {
                  "label": "сами подчиненные",
                  "right": false
                }]
            },
            {
              "question":"При управлении по целям интегрируются и реализуются:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Организационные и групповые цели.",
                  "right": false
                },
                {
                  "label": "Организационные и индивидуальные цели.",
                  "right": false
                },
                {
                  "label": "Организационные, групповые и индивидуальные цели.",
                  "right": true
                },
                {
                  "label": "Индивидуальные и групповые цели.",
                  "right": false
                }]
            },
            {
              "question":"Первый этап процесса управления по целям – выработка ключевых результатов деятельности подразделения. Нормативное число ключевых результатов:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"От 3 до 5.",
                  "right": false
                },
                {
                  "label": "От 4 до 6.",
                  "right": true
                },
                {
                  "label": "От 6 до 8.",
                  "right": false
                }]
            },
            {
              "question":"Функция планирования отвечает на вопрос «ЧТО?», а функция организации –…",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"С какой целью?",
                  "right": false
                },
                {
                  "label": "За что?",
                  "right": false
                },
                {
                  "label": "Кто?",
                  "right": true
                },
                {
                  "label":"Почему?",
                  "right": false
                },
                {
                  "label": "Как?",
                  "right": true
                },
                {
                  "label": "Когда?",
                  "right": false
                }]
            },
            {
              "question":"Закончите фразу: «Делегирование означает передачу прав и полномочий лицу, которое…».",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"хочет их принять",
                  "right": false
                },
                {
                  "label": "обязано их принять в силу должностной инструкции",
                  "right": false
                },
                {
                  "label": "принимает на себя ответственность за их выполнение",
                  "right": true
                }]
            },
            {
              "question":"Фиксированная ответственность – это принцип делегирования полномочий, в соответствии с которым…",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Определяется оптимальное число подчиненных для одного руководителя.",
                  "right": false
                },
                {
                  "label": "Масштабы ответственности не превышают индивидуальных возможностей сотрудника.",
                  "right": false
                },
                {
                  "label": "Делегируются только полномочия, но не управленческая ответственность.",
                  "right": true
                },
                {
                  "label": "Сотрудник получает задание и отвечает за их выполнение только перед одним начальником.",
                  "right": false
                }]
            },
            {
              "question":"Закончите фразу: «Чтобы развить у подчиненных самостоятельность, надо приучить их приходить не с проблемой, а с…».",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"собранной информацией",
                  "right": false
                },
                {
                  "label": "подготовленными вопросами",
                  "right": false
                },
                {
                  "label": "проектом решения",
                  "right": true
                }]
            },
            {
              "question":"Система мотивации сотрудников должна решать три серьезные задачи. Для решения какой из перечисленных ниже задач компании стремятся поддерживать конкурентоспособный уровень заработной платы?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Удержание сотрудников в организации.",
                  "right": true
                },
                {
                  "label": "Повышение результативности и эффективности работы.",
                  "right": false
                },
                {
                  "label": "Обеспечение преданности (приверженности) сотрудников данной компании.",
                  "right": false
                }]
            },
            {
              "question":"Закончите фразу: «Потребность – это чувство…».",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"необходимости изменить ситуацию",
                  "right": false
                },
                {
                  "label": "желания действовать в определенном направлении",
                  "right": false
                },
                {
                  "label": "неудовлетворенности ",
                  "right": true
                },
                {
                  "label": "удовлетворенности",
                  "right": false
                }]
            },
            {
              "question":"Может ли потребность в самореализации доминировать, если не удовлетворена потребность в социальной принадлежности (в соответствии с иерархией потребностей А. Маслоу)?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Да",
                  "right": false
                },
                {
                  "label": "Нет",
                  "right": true
                }]
            },
            {
              "question":"В соответствии с теорией Герцберга, гигиенические факторы:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"мотивируют к более производительному труду",
                  "right": false
                },
                {
                  "label": "влияют на устранение неудовлетворенности сотрудника",
                  "right": true
                }]
            },
            {
              "question":"Закончите фразу: «Сотрудник с высокой мотивацией достижения выберет…».",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"трудновыполнимую задачу",
                  "right": false
                },
                {
                  "label": "среднюю по тяжести задачу",
                  "right": true
                },
                {
                  "label": "легковыполнимую задачу",
                  "right": false
                }]
            },
            {
              "question":"Закончите фразу: «Чем увереннее в своих профессиональных качествах сотрудник – тем…».",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"выше его внутренняя мотивация",
                  "right": true
                },
                {
                  "label": "ниже его внутренняя мотивация",
                  "right": false
                }]
            },
            {
              "question":"Деньги являются мотиватором… ",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"всегда, при любых условиях",
                  "right": false
                },
                {
                  "label": "при определенных условиях ",
                  "right": true
                },
                {
                  "label": "деньги не мотивируют к достижению более высоких результатов",
                  "right": false
                }]
            },
            {
              "question":"Какие способы стимулирования относятся к организационным?",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"Мотивация целями",
                  "right": true
                },
                {
                  "label": "Участие в делах фирмы",
                  "right": true
                },
                {
                  "label": "Информирование сотрудников о результатах работы ",
                  "right": true
                },
                // {
                //   "label": "Делегирование полномочий ",
                //   "right": true
                // },
                // {
                //   "label": "Корпоративная газета ",
                //   "right": true
                // },
                // {
                //   "label": "Перспективы служебного роста ",
                //   "right": true
                // },
                // {
                //   "label":"Обучение",
                //   "right": true
                // },
                // {
                //   "label": "Задания повышенной сложности ",
                //   "right": true
                // },
                // {
                //   "label": "Разнообразие в работе ",
                //   "right": true
                // },
                {
                  "label": "Одобрение",
                  "right": false
                },
                {
                  "label": "Поддержка",
                  "right": false
                },
                {
                  "label": "Уважение и доверие",
                  "right": false
                }
                // ,{
                //   "label":"Внимание к личности и интересам",
                //   "right": false
                // },
                // {
                //   "label": "Сочувствие",
                //   "right": false
                // },
                // {
                //   "label": "Похвала (с глазу на глаз или публичная, в том числе через прессу)",
                //   "right": false
                // },
                // {
                //   "label": "Соревновательный дух",
                //   "right": false
                // },
                // {
                //   "label": "Порицание (с глазу на глаз или публичное, устное – письменное)",
                //   "right": false
                // },
                // {
                //   "label": "Признание заслуг",
                //   "right": false
                // }
                ]
            },
            {
              "question":"Отметьте моральные способы стимулирования.",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                // {
                //   "label":"Мотивация целями",
                //   "right": false
                // },
                // {
                //   "label": "Участие в делах фирмы",
                //   "right": false
                // },
                // {
                //   "label": "Информирование сотрудников о результатах работы ",
                //   "right": false
                // },
                {
                  "label": "Делегирование полномочий ",
                  "right": false
                },
                {
                  "label": "Корпоративная газета ",
                  "right": false
                },
                {
                  "label": "Перспективы служебного роста ",
                  "right": false
                },
                // {
                //   "label":"Обучение",
                //   "right": false
                // },
                // {
                //   "label": "Задания повышенной сложности ",
                //   "right": false
                // },
                // {
                //   "label": "Разнообразие в работе ",
                //   "right": false
                // },
                // {
                //   "label": "Одобрение",
                //   "right": true
                // },
                // {
                //   "label": "Поддержка",
                //   "right": true
                // },
                // {
                //   "label": "Уважение и доверие",
                //   "right": true
                // },
                {
                  "label":"Внимание к личности и интересам",
                  "right": true
                },
                {
                  "label": "Сочувствие",
                  "right": true
                },
                {
                  "label": "Похвала (с глазу на глаз или публичная, в том числе через прессу)",
                  "right": true
                }
                // ,{
                //   "label": "Соревновательный дух",
                //   "right": true
                // },
                // {
                //   "label": "Порицание (с глазу на глаз или публичное, устное – письменное)",
                //   "right": true
                // },
                // {
                //   "label": "Признание заслуг",
                //   "right": true
                // }
                ]
            },
            {
              "question":"Какие теории мотивации объясняют воздействие различных условий на достижение исполнителем рабочих результатов?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "Содержательные.",
                  "right": false
                },
                {
                  "label": "Процессуальные.",
                  "right": true
                }]
            },
            // {
            //   "question":"Руководителю, желающему воздействовать на трудовую мотивацию подчиненных, необходимо сделать пять шагов для того, чтобы добиться желаемого результата. Распределите описанные ниже действия по «шагам».",
            //   "score":-1,
            //   "status":"notanswered",
            //   "type": "single",
            //   "answers":[]
            // },
            {
              "question":"Какие из действий менеджера не относятся к функции контроля?",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"Менеджер устанавливает стандарты выполнения подчиненным функций и задач.",
                  "right": false
                },
                {
                  "label": "Менеджер распределяет поручения между подчиненными. ",
                  "right": true
                },
                {
                  "label": "Менеджер информирует подчиненных о последствиях несоблюдения стандартов. ",
                  "right": true
                },
                {
                  "label": "Менеджер сравнивает фактическое положение дел со стандартами.",
                  "right": false
                },
                {
                  "label": "Менеджер по результатам сравнения вносит изменения  в работу подчиненного или в стандарты.",
                  "right": false
                }]
            },
            {
              "question":"Проверка соответствия качеств и квалификации сотрудника занимаемой должности относится к:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"предварительному виду контроля",
                  "right": true
                },
                {
                  "label": "текущему виду контроля",
                  "right": false
                },
                {
                  "label": "итоговому виду контроля",
                  "right": false
                }]
            },
            // {
            //   "question":"Справедливо ли утверждение? ",
            //   "score":-1,
            //   "status":"notanswered",
            //   "type": "single",
            //   "answers":[]
            // },
            {
              "question":"Руководители часто пренебрегают организацией… коммуникаций. ",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"нисходящих",
                  "right": false
                },
                {
                  "label": "восходящих",
                  "right": true
                },
                {
                  "label": "горизонтальных",
                  "right": false
                }]
            },
            {
              "question":"«Обратная связь» – важнейший инструмент каких функций управления?",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"Планирование ",
                  "right": false
                },
                {
                  "label": "Организация ",
                  "right": false
                },
                {
                  "label": "Мотивация ",
                  "right": true
                },
                {
                  "label": "Контроль ",
                  "right": true
                }]
            },
            {
              "question":"Закончите фразу: «Цель развивающей обратной связи –…».",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"указать подчиненному на его ошибку",
                  "right": false
                },
                {
                  "label": "наказать подчиненного",
                  "right": false
                },
                {
                  "label": "помочь подчиненному ",
                  "right": true
                }]
            },
            {
              "question":"Какой тип решения предпочтительнее в управленческой практике?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Интуитивное решение. ",
                  "right": false
                },
                {
                  "label": "Решение, основанное на суждении.",
                  "right": false
                },
                {
                  "label": "Рациональное решение.",
                  "right": true
                }]
            }
          ]
        }]
    }
  ]
}