var testStructure = {
  "tests":[
    {
      "testId":0,
      "caption":"test0",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"*******************",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"****",
                  "right": false
                },
                {
                  "label": "***",
                  "right": false
                },
                {
                  "label": "***",
                  "right": true
                },
                {
                  "label": "***",
                  "right": false
                }]
            },
            {
              "question":"*******************",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"****",
                  "right": false
                },
                {
                  "label": "***",
                  "right": false
                },
                {
                  "label": "***",
                  "right": true
                },
                {
                  "label": "***",
                  "right": false
                }]
            },
            {
              "question":"*******************",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"****",
                  "right": false
                },
                {
                  "label": "***",
                  "right": false
                },
                {
                  "label": "***",
                  "right": true
                },
                {
                  "label": "***",
                  "right": false
                }]
            },
            {
              "question":"*******************",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"****",
                  "right": false
                },
                {
                  "label": "***",
                  "right": false
                },
                {
                  "label": "***",
                  "right": true
                },
                {
                  "label": "***",
                  "right": false
                }]
            },
            {
              "question":"*******************",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"****",
                  "right": false
                },
                {
                  "label": "***",
                  "right": false
                },
                {
                  "label": "***",
                  "right": true
                },
                {
                  "label": "***",
                  "right": false
                }]
            }
          ]
        }]
    },
    {
      "testId":1,
      "caption":"test1",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Что такое выборочная совокупность?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Определенное количество граждан, из числа которых выбираются респонденты",
                  "right": false
                },
                {
                  "label": "Совокупность граждан, в ходе опроса выбирающих определенный вариант ответа",
                  "right": false
                },
                {
                  "label": "Определенное (или ограниченное) число лиц (домохозяйств), изучение признаков (свойств) которых позволяет характеризовать все население (домохозяйства)",
                  "right": true
                },
                {
                  "label": "Совокупность граждан, обладающих определенными выбранными характеристиками",
                  "right": false
                }]
            },
            {
              "question":"Кто в статистическом наблюдении называется респондентом?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Лицо, которое отвечает на вопросы, задаваемые при проведении выборочного наблюдения по какой-либо теме",
                  "right": true
                },
                {
                  "label": "Человек, отказавшийся отвечать на вопросы интервьюера",
                  "right": false
                },
                {
                  "label": "Человек, организующий сдачу-приемку заполненных бланков ответов, отчетов интервьюеров",
                  "right": false
                },
                {
                  "label": "Каждый член домохозяйства, достигший 16 лет",
                  "right": false
                }]
            },
            {
              "question":"Период проведения наблюдения – это:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"период времени, необходимый интервьюеру непосредственно для опроса респондентов",
                  "right": false
                },
                {
                  "label": "период времени, необходимый интервьюеру для установления первичного контакта с респондентом",
                  "right": false
                },
                {
                  "label": "период времени, в течение которого осуществляется сбор сведений от населения, включая рекрутирование и посещение домохозяйств для опросов",
                  "right": true
                },
                {
                  "label": "весь период проведения исследования, начиная с этапа планирования и заканчивая этапом обработки",
                  "right": false
                }]
            },
            {
              "question":"В чьи обязанности входит координация работы интервьюеров?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Интервьюера",
                  "right": false
                },
                {
                  "label": "Инструктора",
                  "right": true
                },
                {
                  "label": "Респондента",
                  "right": false
                },
                {
                  "label": "Бригадира-инструктора",
                  "right": false
                }]
            },
            {
              "question":"Что из нижеперечисленного НЕ входит в обязанности интервьюера?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Отбор домохозяйств, отвечающих требуемым характеристикам",
                  "right": true
                },
                {
                  "label": "Получение согласия респондента на участие в наблюдении",
                  "right": false
                },
                {
                  "label": "Заполнение бланков вопросников",
                  "right": false
                },
                {
                  "label": "Подготовка отчетности по результатам опросов",
                  "right": false
                }]
            }
          ]
        }]
    },
    {
      "testId":2,
      "caption":"test2",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Сколько домохозяйств следует опросить интервьюеру?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"24",
                  "right": true
                },
                {
                  "label": "36",
                  "right": false
                },
                {
                  "label": "48",
                  "right": false
                },
                {
                  "label": "72",
                  "right": false
                }]
            },
            {
              "question":"К резервному списку домохозяйств относятся:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"все домохозяйства, входящие в выборочную совокупность",
                  "right": false
                },
                {
                  "label": "все домохозяйства на территории участка наблюдения, сходные с отобранными",
                  "right": false
                },
                {
                  "label": "другие домохозяйства, относящиеся к одному участку наблюдения",
                  "right": false
                },
                {
                  "label": "домохозяйства, отобранные в качестве дополнительного массива",
                  "right": true
                }]
            },
            {
              "question":"Маршрут интервьюера определяется:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"численностью членов домохозяйства",
                  "right": false
                },
                {
                  "label": "порядковым номером домохозяйства",
                  "right": true
                },
                {
                  "label": "территориальной расположенностью домохозяйства",
                  "right": false
                },
                {
                  "label": "не имеет значения",
                  "right": false
                }]
            },
            {
              "question":"В случае отсутствия членов домохозяйства по указанному адресу интервьюеру следует:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"прийти еще несколько раз",
                  "right": true
                },
                {
                  "label": "позвонить и договориться о встрече",
                  "right": false
                },
                {
                  "label": "уведомить инструктора",
                  "right": false
                },
                {
                  "label": "обратиться к резервному списку",
                  "right": false
                }]
            },
            {
              "question":"Какими должны быть действия интервьюера в случае, когда план наблюдения не выполнен, а основной и резервный списки отобранных домохозяйств исчерпаны?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Обойти еще раз домохозяйства, отказавшиеся от участия в наблюдении.",
                  "right": false
                },
                {
                  "label": "Попробовать привлечь к участию в наблюдении домохозяйства, проживающие по адресам, которые не были отобраны.",
                  "right": false
                },
                {
                  "label": "Оперативно передать инструктору сведения о невыполнении плана наблюдения.",
                  "right": true
                },
                {
                  "label": "Обратиться к родным и знакомым с целью их привлечения к участию в наблюдении.",
                  "right": false
                }]
            }
          ]
        }]
    },
    {
      "testId":3,
      "caption":"test3",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Что из ниже перечисленного допустимо в действиях интервьюера?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Проводить опрос членов домохозяйства за пределами места постоянного проживания.",
                  "right": false
                },
                {
                  "label": "Вносить исправления в формы обследования без ведома членов обследуемого домохозяйства.",
                  "right": false
                },
                {
                  "label": "Оказывать влияние на содержание ответов респондентов.",
                  "right": false
                },
                {
                  "label": "Спрашивать телефон для связи с обследуемым домохозяйством.",
                  "right": true
                }]
            },
            {
              "question":"Каким образом можно подтвердить правильность ответов респондента?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Проверить по личным или платежным документам, справкам и т.п. в домохозяйстве.",
                  "right": false
                },
                {
                  "label": "Проверить посредством посещения различных организаций (Пенсионный фонд, собесы, ЖЭК и т.п.), даже спросить у соседей.",
                  "right": false
                },
                {
                  "label": "Проверки не требуется, регистрация производится со слов респондента.",
                  "right": true
                },
                {
                  "label": "Взять с респондента обещание говорить «правду и только правду».",
                  "right": false
                }]
            },
            {
              "question":"Отметьте, какие из следующих положений являются нарушением правил заполнения вопросников? ",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Задавать вопросы в том порядке, в котором они указаны в вопроснике. ",
                  "right": false
                },
                {
                  "label": "Обязательно зачитывать респонденту все варианты ответов.",
                  "right": false
                },
                {
                  "label": "Соблюдать указания по технике заполнения вопросников, следовать условным обозначениям.",
                  "right": false
                },
                {
                  "label": "Своевременно использовать при опросе респондентов соответствующие карточки.",
                  "right": true
                },
                {
                  "label": "При затруднении с ответом подсказать респонденту наиболее часто выбираемые варианты.",
                  "right": true
                }]
            },
            {
              "question":"Какой из перечисленных разделов не входит в вопросник для домохозяйства?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Условия проживания.",
                  "right": false
                },
                {
                  "label": "Выплаты на детей в возрасте до 16 лет.",
                  "right": false
                },
                {
                  "label": "Сельскохозяйственная деятельность.",
                  "right": false
                },
                {
                  "label": "Пенсионное обеспечение и социальная поддержка.",
                  "right": true
                }]
            },
            {
              "question":"Как следует читать текст (заключенный в круглые скобки)?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Не зачитывать вслух респонденту.",
                  "right": false
                },
                {
                  "label": "Обратить особое внимание респондента.",
                  "right": false
                },
                {
                  "label": "Определять необходимость зачитать в зависимости от ситуации (от полученной ранее информации).",
                  "right": true
                },
                {
                  "label": "Всегда зачитывать респонденту полный текст вопроса.",
                  "right": false
                }]
            }
          ]
        }]
    },
    {
      "testId":4,
      "caption":"test4",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Адресная часть вопросника для домохозяйства заполняется:",
              "score":-1,
              "status":"notanswered",
              "type":"single",
              "answers": [
                {
                  "label": "полностью сотрудниками ТОГС",
                  "right": false
                },
                {
                  "label": "частично сотрудниками ТОГС, частично интервьюером",
                  "right": false
                },
                {
                  "label": "полностью интервьюером (по образцу ТОГС)",
                  "right": true
                },
                {
                  "label": "самостоятельно респондентом",
                  "right": false
                }]
            },
            {
              "question":"Индивидуальный вопросник НЕ заполняется, если член домохозяйства отсутствует:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"на момент проведения опроса",
                  "right": false
                },
                {
                  "label": "менее полугода",
                  "right": false
                },
                {
                  "label": "более года",
                  "right": true
                },
                {
                  "label": "менее месяца",
                  "right": false
                }]
            },
            {
              "question":"Ответственным лицом является:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"один из взрослых членов домохозяйства, более других осведомленный обо всех аспектах жизнедеятельности домохозяйства",
                  "right": true
                },
                {
                  "label": "один из взрослых членов домохозяйства, заранее указанный в списке сотрудниками ТОГС",
                  "right": false
                },
                {
                  "label": "один из взрослых членов домохозяйства, внесший наибольший вклад в общий бюджет домохозяйства в прошлом году",
                  "right": false
                },
                {
                  "label": "интервьюер, отвечающий за проведение опроса на участке наблюдения",
                  "right": false
                }]
            },
            {
              "question":"Порядковый номер семейной единицы в домохозяйстве:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"отражает степень родства между членами домохозяйства",
                  "right": false
                },
                {
                  "label": "присваивается единый супругам и их детям вне зависимости от возраста, не состоящим в браке",
                  "right": true
                },
                {
                  "label": "проставляется от младшего к старшему члену домохозяйства",
                  "right": false
                },
                {
                  "label": "проставляется от старшего к младшему члену домохозяйства",
                  "right": false
                }]
            },
            {
              "question":"Индивидуальный вопросник обязательно заполняется на лиц:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"отсутствующих в связи с прохождением военной службы по призыву или контракту",
                  "right": false
                },
                {
                  "label": "отсутствующих менее 18 месяцев",
                  "right": false
                },
                {
                  "label": "до 16-ти лет, если на них получалось пособие",
                  "right": false
                },
                {
                  "label": "внесших наибольший вклад в общий бюджет домохозяйства в прошлом году",
                  "right": true
                }]
            }
          ]
        }]
    },
    {
      "testId":5,
      "caption":"test5",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Укажите, на кого из детей должен быть заполнен раздел 2 Вопросника для домохозяйства:",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"родился 15 января 2017 года",
                  "right": false
                },
                {
                  "label": "исполнилось 16 лет 31 декабря 2016 года",
                  "right": true
                },
                {
                  "label": "родился 31 декабря 2016 года",
                  "right": true
                },
                {
                  "label": "исполнилось 16 лет 1 февраля 2017 года",
                  "right": false
                }]
            },
            {
              "question":"Если в домохозяйстве более четырех детей в возрасте 0–15 лет, как фиксируется информация на пятого и далее ребенка?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Следует зафиксировать информацию по остальным детям на отдельном листе.",
                  "right": false
                },
                {
                  "label": "Следует взять дополнительный вопросник и заполнить необходимую информацию только по разделу 2 на остальных детей.",
                  "right": true
                },
                {
                  "label": "Следует зафиксировать информацию на обратной стороне бланка.",
                  "right": false
                },
                {
                  "label": "Следует записать информацию по четырем младшим детям, которым позже других исполнится 16 лет.",
                  "right": false
                }]
            },
            {
              "question":"Какой код проставляется ребенку по строке «тип семейной единицы»?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Одиночка.",
                  "right": false
                },
                {
                  "label": "Переносится из раздела 1 «Состав домохозяйства».",
                  "right": true
                },
                {
                  "label": "Ребенок, находящийся на попечении.",
                  "right": false
                },
                {
                  "label": "Ребенок, проживающий с одним или обоими родителями.",
                  "right": false
                }]
            },
            {
              "question":"При отсутствии у ребенка обоих родителей:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"ребенку присуждается отдельный код",
                  "right": false
                },
                {
                  "label": "отмечается код члена домохозяйства, внесшего наибольший вклад в бюджет за прошедший год",
                  "right": false
                },
                {
                  "label": "отмечается код члена домохозяйства – опекуна ребенка",
                  "right": true
                },
                {
                  "label": "код ребенку не проставляется",
                  "right": false
                }]
            },
            {
              "question":"Обучение считается бесплатным, если расходы по ведению учебного процесса:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"полностью осуществляются за счет средств бюджета государственного или муниципального уровня",
                  "right": true
                },
                {
                  "label": "осуществляются за счет лиц или организаций, не являющихся родителями или опекунами",
                  "right": false
                },
                {
                  "label": "возмещаются родителями или опекунами в полном объеме",
                  "right": false
                },
                {
                  "label": "снижены за счет предоставления льгот на обучение в размере 80% и более от суммы оплаты",
                  "right": false
                }]
            }
          ]
        }]
    },
    {
      "testId":6,
      "caption":"test6",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Денежная помощь в связи со смертью близких родственников оказывается:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"органом социальной защиты населения",
                  "right": true
                },
                {
                  "label": "органом социальной защиты населения на основании заключения социального контракта",
                  "right": false
                },
                {
                  "label": "благотворительными фондами",
                  "right": false
                },
                {
                  "label": "такого вида помощи нет",
                  "right": false
                }]
            },
            {
              "question":"Социальный контракт – это договор о взаимных обязательствах между:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"малоимущим гражданином и некоммерческой организацией (учреждением, фондом взаимопомощи) о предоставлении ему и (или его семье) социальной помощи",
                  "right": false
                },
                {
                  "label": "малоимущим гражданином и органом социальной защиты населения о предоставлении ему и (или его семье) государственной социальной помощи",
                  "right": true
                },
                {
                  "label": "между органом социальной защиты населения и поставщиками социальных услуг о предоставлении помощи малоимущим гражданам и (или) их семьям",
                  "right": false
                }]
            },
            {
              "question":"Какие из нижеперечисленных выплат фиксируются как помощь домохозяйству из источников, отличных от органов социальной защиты?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Выплаты алиментов детям до 16 лет.",
                  "right": false
                },
                {
                  "label": "Выплаты, назначенные по решению суда.",
                  "right": false
                },
                {
                  "label": "Натуральная помощь по месту работы членов домохозяйства.",
                  "right": false
                },
                {
                  "label": "Помощь, оказанная родственниками, знакомыми, другими частными лицами.",
                  "right": true
                }]
            },
            {
              "question":"При фиксации получения членами домохозяйства денежных средств из других регионов России или из-за границы НЕ учитывается:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"поступления на счета (или передачи в руки) кого-либо из членов домохозяйства",
                  "right": false
                },
                {
                  "label": "поступления на счета организаций, оказывающих услуги в интересах членов домохозяйства",
                  "right": false
                },
                {
                  "label": "поступления, связанные с осуществлением трудовой деятельности членов домохозяйства",
                  "right": true
                },
                {
                  "label": "все перечисленные виды учитываются",
                  "right": false
                }]
            },
            {
              "question":"Если часть денежных средств, полученных из других регионов России или из-за границы, уже учитывалась ранее в этом или другом разделе, то:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"эта сумма не указывается в этом разделе",
                  "right": false
                },
                {
                  "label": "эта сумма вычеркивается из другого раздела",
                  "right": false
                },
                {
                  "label": "эта сумма указывается в специальной строке",
                  "right": true
                },
                {
                  "label": "эта сумма указывается дважды в разных разделах",
                  "right": false
                }]
            }
          ]
        }]
    },
    {
      "testId":7,
      "caption":"test7",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"В случае, когда домохозяйство сдает комнату в своей квартире, какой код должен быть отмечен в вопросе 1?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Коммунальная квартира.",
                  "right": false
                },
                {
                  "label": "Отдельная квартира.",
                  "right": true
                },
                {
                  "label": "Другое.",
                  "right": false
                }]
            },
            {
              "question":"К жилищным услугам НЕ относится:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"водоотведение (канализация)",
                  "right": true
                },
                {
                  "label": "плата за найм жилого помещения",
                  "right": false
                },
                {
                  "label": "плата за содержание и ремонт общего имущества в многоквартирном доме; капитальный ремонт",
                  "right": false
                },
                {
                  "label": "вывоз твердых и жидких бытовых отходов",
                  "right": false
                }]
            },
            {
              "question":"К коммунальным платежам НЕ относятся:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"платежи за холодное и горячее водоснабжение",
                  "right": false
                },
                {
                  "label": "платежи за электричество",
                  "right": false
                },
                {
                  "label": "платежи по страхованию жилья",
                  "right": true
                },
                {
                  "label": "платежи за поставки бытового газа в баллонах",
                  "right": false
                }]
            },
            {
              "question":"Код 3 в вопросе 4 «ЖИЛЬЕ И ЖКУ НЕ ОПЛАЧИВАЛИСЬ ИЗ СРЕДСТВ ДОМОХОЗЯЙСТВА» отмечается в том случае, если:",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"данные расходы производились полностью за счет других юридических лиц",
                  "right": true
                },
                {
                  "label": "домохозяйство принципиально не оплачивает жилье и услуги жилищно-коммунального хозяйства",
                  "right": false
                },
                {
                  "label": "данные расходы производились полностью за счет других физических лиц, не являющихся членами домохозяйства",
                  "right": true
                }]
            },
            {
              "question":"Код 1 в вопросе 2 «ИПОТЕКА ВЫПЛАЧИВАЕТСЯ» НЕ ставится в случае, если:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"ипотечный кредит выплачивается полностью за счет других физических лиц",
                  "right": false
                },
                {
                  "label": "ипотечный кредит был выплачен ранее и в прошлом году уже не выплачивался",
                  "right": true
                },
                {
                  "label": "последняя выплата по ипотеке уже была произведена в прошлом году",
                  "right": false
                },
                {
                  "label": "домохозяйство получает жилищную субсидию",
                  "right": false
                }]
            }
          ]
        }]
    },
    {
      "testId":8,
      "caption":"test8",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"В вопросе о платежах, связанных с недвижимостью, НЕ рассматриваются:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"текущие налоги на имущество",
                  "right": false
                },
                {
                  "label": "налоги на доход от продажи имущества",
                  "right": true
                },
                {
                  "label": "налог на имущество, переходящее в порядке наследования, дарения",
                  "right": false
                },
                {
                  "label": "страхование имущества",
                  "right": false
                }]
            },
            {
              "question":"В вопросе о сдаче в аренду недвижимости доходы НЕ учитываются в случае, если сдаваемое помещение является:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"нежилым",
                  "right": false
                },
                {
                  "label": "для сезонного проживания",
                  "right": false
                },
                {
                  "label": "основным",
                  "right": false
                },
                {
                  "label": "страхование дееспособности водителя",
                  "right": true
                }]
            },
            {
              "question":"Обязательным видом транспортного страхования является:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"страхование транспортного средства",
                  "right": false
                },
                {
                  "label": "страхование жизни водителя",
                  "right": false
                },
                {
                  "label": "страхование гражданской ответственности водителя",
                  "right": true
                },
                {
                  "label": "страхование дееспособности водителя",
                  "right": false
                }]
            },
            {
              "question":"Оплата техосмотра входит в категорию:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"транспортных налогов",
                  "right": false
                },
                {
                  "label": "платежей по страхованию гражданской ответственности владельцев автотранспортных средств",
                  "right": false
                },
                {
                  "label": "платежей по добровольному страхованию транспортных средств",
                  "right": false
                },
                {
                  "label": "других сборов и платежей, взимаемых с владельцев автотранспорта",
                  "right": true
                }]
            },
            {
              "question":"В каком случае доход от транспортного средства и техники НЕ фиксируется?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Техника использовалась для оказания платных услуг.",
                  "right": false
                },
                {
                  "label": "Техника сдавалась во временное пользование.",
                  "right": false
                },
                {
                  "label": "Техника использовалась в служебных целях с дополнительной платой.",
                  "right": false
                },
                {
                  "label": "Техника использовалось для нужд собственного фермерского хозяйства.",
                  "right": true
                }]
            }
          ]
        }]
    },
    {
      "testId":9,
      "caption":"test9",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Какой вид сельскохозяйственной деятельности НЕ отражен в разделе 6 Вопросника для домохозяйства?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Сбор и заготовка дикорастущих растений.",
                  "right": false
                },
                {
                  "label": "Переработка сырья.",
                  "right": true
                },
                {
                  "label": "Охота и рыболовство.",
                  "right": false
                },
                {
                  "label": "Животноводство.",
                  "right": false
                }]
            },
            {
              "question":"В разделе 6 Вопросника для домохозяйства НЕ фиксируются земельные участки:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"обрабатывавшиеся членами домохозяйства за плату",
                  "right": true
                },
                {
                  "label": "находящиеся в частичной собственности домохозяйства",
                  "right": false
                },
                {
                  "label": "использовавшиеся домохозяйством самовольно",
                  "right": false
                },
                {
                  "label": "взятые домохозяйством в аренду",
                  "right": false
                }]
            },
            {
              "question":"В каких единицах указывается в вопроснике площадь земельного участка?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"В арах.",
                  "right": false
                },
                {
                  "label": "В гектарах.",
                  "right": true
                },
                {
                  "label": "В сотках.",
                  "right": false
                },
                {
                  "label": "В квадратных метрах.",
                  "right": false
                }]
            },
            {
              "question":"В собственности домохозяйства имеется два земельных участка. Как зафиксировать их размеры в вопросе 2?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Указать в размер наибольшего участка.",
                  "right": false
                },
                {
                  "label": "Указать размер одного из участков по строке 1, другого – по строке 3.",
                  "right": false
                },
                {
                  "label": "Указать сумму размеров участков по строке 1.",
                  "right": true
                },
                {
                  "label": "Указать размер наиболее близкого участка.",
                  "right": false
                }]
            },
            {
              "question":"Сельскохозяйственная продукция, произведенная для личного потребления, не учитывается, если:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"была безвозмездно передана в другие домохозяйства или на благотворительные цели",
                  "right": true
                },
                {
                  "label": "в получении этой продукции участвовали другие лица, не являющиеся членами домохозяйства",
                  "right": false
                },
                {
                  "label": "домохозяйство отдавало эту продукцию в обмен на услуги",
                  "right": false
                },
                {
                  "label": "затраты на ее производство превышают ее стоимость",
                  "right": false
                }]
            }
          ]
        }]
    },
    {
      "testId":10,
      "caption":"test10",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"При подсчете доходов домохозяйства указываются: ",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"доходы члена домохозяйства, являющегося основным кормильцем",
                  "right": false
                },
                {
                  "label": "доходы от трудовой деятельности взрослых членов домохозяйства",
                  "right": false
                },
                {
                  "label": "доходы от совместной деятельности или от совместного имущества",
                  "right": false
                },
                {
                  "label": "сумма всех регулярных доходов домохозяйства.",
                  "right": true
                }]
            },
            {
              "question":"Понятие «необходимые ежедневные платежи» определяется исходя из:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"минимальной потребительской корзины",
                  "right": false
                },
                {
                  "label": "индекса качества жизни по стране",
                  "right": false
                },
                {
                  "label": "представлений самого домохозяйства",
                  "right": true
                },
                {
                  "label": "экономического статуса домохозяйства",
                  "right": false
                }]
            },
            {
              "question":"В вопросе о минимальном месячном доходе, достаточном для домохозяйства:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"к доходу прибавляется стоимость вещей или услуг, которые домохозяйство не может позволить",
                  "right": false
                },
                {
                  "label": "респондент называет сумму самостоятельно",
                  "right": true
                },
                {
                  "label": "интервьюер производит подсчет всех указанных расходов",
                  "right": false
                },
                {
                  "label": "из дохода вычитается сумма регулярных выплат",
                  "right": false
                }]
            },
            {
              "question":"В перечень предметов длительного пользования первой необходимости НЕ входит:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"компьютер",
                  "right": false
                },
                {
                  "label": "микроволновая печь",
                  "right": true
                },
                {
                  "label": "телевизор",
                  "right": false
                },
                {
                  "label": "автомобиль",
                  "right": false
                }]
            },
            {
              "question":"Что из перечисленного НЕ учитывается в вопросе, оценивающем материальные возможности домохозяйства:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "возможность оплатить дополнительные образовательные услуги",
                  "right": true
                },
                {
                  "label": "возможность покупать каждому члену семьи две пары удобной и подходящей по сезону обуви",
                  "right": false
                }]
            }]
        }]
    },
    {
      "testId":11,
      "caption":"test11",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Определяющие факторы установления первого контакта с респондентом:",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"наличие папки (портфеля) с документами",
                  "right": false
                },
                {
                  "label": "проявление понимания, что приходится отвлекать респондента от его занятий",
                  "right": false
                },
                {
                  "label": "внешний вид интервьюера",
                  "right": true
                },
                {
                  "label": "манера речи",
                  "right": true
                }]
            },
            {
              "question":"При выборе времени интервьюирования необходимо ориентироваться на:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"собственный график",
                  "right": false
                },
                {
                  "label": "график респондента",
                  "right": true
                },
                {
                  "label": "день недели",
                  "right": false
                },
                {
                  "label": "время дня",
                  "right": false
                }]
            },
            {
              "question":"Основную часть беседы следует начать с:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"представления; ",
                  "right": false
                },
                {
                  "label": "гарантий конфиденциальности",
                  "right": false
                },
                {
                  "label": "важности проводимого исследования",
                  "right": false
                },
                {
                  "label": "объяснения процедуры интервью",
                  "right": true
                }]
            },
            {
              "question":"Какой должна быть реакция интервьюера на ответы респондента при интервью?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Недоверчивая. ",
                  "right": false
                },
                {
                  "label": "С ремарками по содержанию ответа",
                  "right": false
                },
                {
                  "label": "Нейтральная",
                  "right": true
                },
                {
                  "label": "С требованием дать пояснения выбору варианта ответа",
                  "right": false
                }]
            },
            {
              "question":"Основное правило чтения вопросов:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"с пропусками, если интервьюер считает, что ответ сам собой разумеется; ",
                  "right": false
                },
                {
                  "label": "с сокращениями, чтобы ускорить интервью",
                  "right": false
                },
                {
                  "label": "без прочтения, своими словами; ",
                  "right": false
                },
                {
                  "label": "без изменения формулировок и последовательности",
                  "right": true
                }]
            }]
        }]
    },
    {
      "testId":12,
      "caption":"test12",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Адресная часть индивидуального вопросника заполняется:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"частично сотрудниками ТОГС, частично интервьюером",
                  "right": false
                },
                {
                  "label": "полностью интервьюером",
                  "right": true
                },
                {
                  "label": "частично интервьюером, частично респондентом",
                  "right": false
                },
                {
                  "label": "самостоятельно респондентом",
                  "right": false
                }]
            },
            {
              "question":"Статус основной деятельности респондента определяется по состоянию на:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"момент проведения опроса",
                  "right": false
                },
                {
                  "label": "31 декабря 2016 года",
                  "right": false
                },
                {
                  "label": "начало прошлого года",
                  "right": false
                },
                {
                  "label": "первый месяц прошлого года и все последующие",
                  "right": true
                }]
            },
            {
              "question":"К категории «работающий по найму» НЕ относятся:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"члены производственного кооператива (артели)",
                  "right": true
                },
                {
                  "label": "лица, работающие на предприятии (в учреждении, организации)",
                  "right": false
                },
                {
                  "label": "лица, оказывающие платные услуги физическим лицам",
                  "right": false
                },
                {
                  "label": "лица, проходящие службу в органах внутренних дел",
                  "right": false
                }]
            },
            {
              "question":"Обучение считается бесплатным, если расходы по ведению учебного процесса:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"полностью оплачиваются из средств спонсора",
                  "right": false
                },
                {
                  "label": "осуществляются за счет средств бюджета государственного или муниципального уровня",
                  "right": true
                },
                {
                  "label": "возмещаются родителям или опекунам в полном объеме",
                  "right": false
                },
                {
                  "label": "осуществляются за счет предприятия",
                  "right": false
                }]
            },
            {
              "question":"Код «неполное высшее (незаконченное высшее) образование присваивается, если:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"респондент является студентом, но пока не закончил образование",
                  "right": false
                },
                {
                  "label": "респондент окончил 3 курса и более",
                  "right": false
                },
                {
                  "label": "респондентам, получившим диплом о неполном высшем образовании",
                  "right": true
                },
                {
                  "label": "респондент не завершил обучение по основной образовательной программе высшего образования",
                  "right": false
                }]
            }]
        }]
    },
    {
      "testId":13,
      "caption":"test13",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Кому задаются вопросы раздела?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Мужчинам после 60 лет, женщинам после 55 лет",
                  "right": false
                },
                {
                  "label": "Лицам со страховым стажем не менее 15 лет",
                  "right": false
                },
                {
                  "label": "Лицам, достигшим минимального пенсионного возраста",
                  "right": false
                },
                {
                  "label": "Всем респондентам",
                  "right": true
                }]
            },
            {
              "question":"Лицам, заработавшим часть своего страхового стажа на работах с вредными, тяжелыми условиями труда, а также в районах Крайнего Севера, назначается:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"досрочная страховая пенсия",
                  "right": true
                },
                {
                  "label": "пенсия по государственному пенсионному обеспечению",
                  "right": false
                },
                {
                  "label": "социальная пенсия",
                  "right": false
                },
                {
                  "label": "страховая пенсия по инвалидности",
                  "right": false
                }]
            },
            {
              "question":"Социальная пенсия по инвалидности назначается:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"инвалидам-участникам ВОВ, лицам, получившим травмы или заболевания на военной службе",
                  "right": false
                },
                {
                  "label": "гражданам из числа застрахованных лиц, признанных инвалидами I, II или III группы",
                  "right": false
                },
                {
                  "label": "инвалидам при полном отсутствии у них страхового стажа",
                  "right": true
                },
                {
                  "label": "гражданам, пострадавшим в результате радиационных или техногенных катастроф",
                  "right": false
                }]
            },
            {
              "question":"Что из перечисленного не входит в набор социальных услуг?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Предоставление путевок на санаторно-курортное лечение",
                  "right": false
                },
                {
                  "label": "Бесплатный проезд к месту лечения и обратно",
                  "right": false
                },
                {
                  "label": "Обеспечение минимальным набором продуктов питания",
                  "right": true
                },
                {
                  "label": "Дополнительную бесплатную медицинскую помощь и обеспечение лекарственными средствами",
                  "right": false
                }]
            },
            {
              "question":"На вопросы о материнском капитале отвечают:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"женщины старше 18 лет",
                  "right": false
                },
                {
                  "label": "женщины, имеющие нескольких детей, младший из которых родился в 2016 году",
                  "right": false
                },
                {
                  "label": "женщины, имеющие нескольких детей, младший из которых родился не ранее 2007 года",
                  "right": true
                },
                {
                  "label": "женщины до 45 лет",
                  "right": false
                }]
            }]
        }]
    },
    {
      "testId":14,
      "caption":"test14",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Оплачиваемая работа или доходное занятие фиксируется только в том случае, если:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"респондент был занят на ней хотя бы одну неделю",
                  "right": false
                },
                {
                  "label": "респондент был занят на ней не менее месяца",
                  "right": false
                },
                {
                  "label": "эта занятость официально оформлена",
                  "right": true
                },
                {
                  "label": "эта работа является источником существования",
                  "right": false
                }]
            },
            {
              "question":"К доходным занятиям относится:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"владение акциями без непосредственного участия в экономической деятельности этой организации",
                  "right": false
                },
                {
                  "label": "работа в собственном домашнем хозяйстве по производству товаров для продажи (обмена)",
                  "right": true
                },
                {
                  "label": "учеба в образовательных организациях в случае получения стипендии",
                  "right": false
                },
                {
                  "label": "производство продукции в личном подсобном хозяйстве только для собственного потребления",
                  "right": false
                }]
            },
            {
              "question":"При наличии у респондента нескольких мест работы основным считается:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"то, которое занимает больше времени",
                  "right": false
                },
                {
                  "label": "то, которое приносит больший доход",
                  "right": false
                },
                {
                  "label": "официально оформленное",
                  "right": false
                },
                {
                  "label": "то, которое считает основным сам респондент",
                  "right": true
                }]
            },
            {
              "question":"При заполнении вопроса о количестве фактически отработанного времени указывается: ",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"число дней работы в месяц и количество часов в среднем за один день с учетом сверхурочных и за вычетом перерыва на обед",
                  "right": true
                },
                {
                  "label": "число рабочих дней средней продолжительности за год за вычетом отпуска",
                  "right": false
                },
                {
                  "label": "время работы в течение нормального рабочего дня, включая перерыв на обед, умноженное на число отработанных дней в месяц",
                  "right": false
                },
                {
                  "label": "время работы в течение нормального рабочего дня, учитывая сверхурочную работу и время, отработанное по совместительству, умноженное на число рабочих дней",
                  "right": false
                }]
            },
            {
              "question":"Какие дополнения к заработной плате не фиксируются?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Сверхурочные",
                  "right": false
                },
                {
                  "label": "Премии к праздникам",
                  "right": false
                },
                {
                  "label": "Чаевые",
                  "right": false
                },
                {
                  "label": "Фиксируется все перечисленное",
                  "right": true
                }]
            },
            {
              "question":"Информация о предпринимательской деятельности не фиксируется, если:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"она не приносила дохода в прошлом году",
                  "right": false
                },
                {
                  "label": "она фиксируется в Индивидуальном вопроснике другого члена домохозяйства",
                  "right": true
                },
                {
                  "label": "она носит эпизодический характер",
                  "right": false
                },
                {
                  "label": "она выполнялась самостоятельно",
                  "right": false
                }]
            },
            {
              "question":"В каком случае физическое лицо не имеет права на получение детского налогового вычета?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Итоговый суммарный доход работника в течение рабочего года превысил 350 000 рублей",
                  "right": true
                },
                {
                  "label": "Если у него только один ребенок в возрасте от 0 до 18 лет",
                  "right": false
                },
                {
                  "label": "Если ребенок является студентом очной формы",
                  "right": false
                },
                {
                  "label": "Если ребенок здоров и не имеет инвалидности",
                  "right": false
                }]
            }]
        }]
    },
    {
      "testId":15,
      "caption":"test15",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Замечания относительно качества вопросов и интервью следует записывать:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"в специальном разделе вопросника непосредственно во время проведения интервью",
                  "right": true
                },
                {
                  "label": "в специальном разделе вопросника при подготовке к сдаче отчетности",
                  "right": false
                },
                {
                  "label": "на полях во время опроса, после того, как опрос завершен и интервьюер покинул домохозяйство, затем перенести в специальный раздел",
                  "right": false
                },
                {
                  "label": "на отдельном листе",
                  "right": false
                }]
            },
            {
              "question":"Вопрос, вызывающий у респондента негативную эмоциональную реакцию, желание скрыть информацию, относится к категории:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"непонятных",
                  "right": false
                },
                {
                  "label": "деликатных",
                  "right": true
                },
                {
                  "label": "сложных",
                  "right": false
                },
                {
                  "label": "неполных",
                  "right": false
                }]
            },
            {
              "question":"Отчет о рекрутировании домохозяйств содержит информацию:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"о всех домохозяйствах, отобранных для проведения наблюдения на участке",
                  "right": false
                },
                {
                  "label": "о домохозяйствах, согласившихся принять участие в наблюдении",
                  "right": false
                },
                {
                  "label": "обо всех домохозяйствах, которые посещал интервьюер",
                  "right": true
                },
                {
                  "label": "о домохозяйствах, с представителями которых интервьюер вступал во взаимодействие",
                  "right": false
                }]
            },
            {
              "question":"Адресная часть отчета о рекрутировании заполняется:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"полностью сотрудниками ТОГС",
                  "right": false
                },
                {
                  "label": "частично сотрудниками ТОГС, частично интервьюером",
                  "right": false
                },
                {
                  "label": "полностью интервьюером",
                  "right": true
                },
                {
                  "label": "частично интервьюером, частично респондентом",
                  "right": false
                }]
            },
            {
              "question":"Вариант «опрос проведен частично» ставится в том случае, если ",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"интервьюер начал проводить опрос в домохозяйстве, но по каким-то причинам домохозяйство предложило интервьюеру прийти в другой день для продолжения опроса",
                  "right": false
                },
                {
                  "label": "домохозяйство согласилось принять участие в наблюдении, но по какой-то причине опрос не был проведен",
                  "right": false
                },
                {
                  "label": "на момент опроса дома были не все члены домохозяйства",
                  "right": false
                },
                {
                  "label": "домохозяйство на этапе опроса отказалось от участия в наблюдении, но частично вопросники уже заполнены",
                  "right": true
                }]
            }]
        }]
    },
    {
      "testId":16,
      "caption":"test16",
      "type":"section",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Отметьте качества, которые следует демонстрировать интервьюеру в ходе интервью:",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"пессимизм по отношению к теме интервью",
                  "right": false
                },
                {
                  "label": "общая позитивную настроенность на общение",
                  "right": true
                },
                {
                  "label": "желание не стеснять респондента",
                  "right": false
                },
                {
                  "label": "энергичность",
                  "right": true
                },
                {
                  "label": "интерес к опросу и ответам респондента",
                  "right": true
                },
                {
                  "label": "восприятие ответов респондента как заранее ожидаемых",
                  "right": false
                },
                {
                  "label": "доброжелательность",
                  "right": true
                }]
            },
            {
              "question":"К показателям эффективности работы интервьюера НЕ относится:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"полнота и достоверность собираемых сведений",
                  "right": false
                },
                {
                  "label": "низкий процент отказа домохозяйств от участия в наблюдении",
                  "right": false
                },
                {
                  "label": "отсутствие (минимальное количество) ответов «затрудняюсь ответить»",
                  "right": false
                },
                {
                  "label": "количество заполненных бланков",
                  "right": true
                }]
            },
            {
              "question":"Невербальная «обратная связь» с респондентом – это:",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"мимика, жесты",
                  "right": true
                },
                {
                  "label": "слова одобрения",
                  "right": false
                },
                {
                  "label": "просьба уточнить ответ",
                  "right": false
                },
                {
                  "label": "интонация речи",
                  "right": true
                }]
            },
            {
              "question":"Речь интервьюера во время общения с респондентом должна быть:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"максимально громкой, энергичной",
                  "right": false
                },
                {
                  "label": "развернутой, с разъяснением терминологии",
                  "right": false
                },
                {
                  "label": "ровной, монотонной",
                  "right": false
                },
                {
                  "label": "четкой и внятной",
                  "right": true
                }]
            },
            {
              "question":"По завершении интервью какая информация должна быть внесена интервьюером в вопросники, находясь вне домохозяйства?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Поправки по ответам респондента",
                  "right": false
                },
                {
                  "label": "Предполагаемые ответы респондента на пропущенные вопросы",
                  "right": false
                },
                {
                  "label": "Замечания по итогам интервью в специальные разделы вопросника",
                  "right": true
                },
                {
                  "label": "Работа завершена, никакая информация более не регистрируется",
                  "right": false
                }]
            }]
        }]
    },
    {
      "testId":17,
      "caption":"test17",
      "type":"final",
      "groups":[
        {
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question":"Единицей наблюдения в Выборочном наблюдении доходов населения и участия в социальных программах является:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"квартира",
                  "right": false
                },
                {
                  "label": "домохозяйство",
                  "right": true
                },
                {
                  "label": "доходы семьи",
                  "right": false
                },
                {
                  "label": "уровень жизни населения",
                  "right": false
                }]
            },
            {
              "question":"В случае отсутствия членов домохозяйства по указанному адресу интервьюеру следует:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"прийти по адресу еще несколько раз",
                  "right": true
                },
                {
                  "label": "позвонить и договориться о встрече",
                  "right": false
                },
                {
                  "label": "уведомить инструктора",
                  "right": false
                },
                {
                  "label": "обратиться к резервному списку",
                  "right": false
                }]
            },
            {
              "question":"Что из нижеперечисленного НЕ входит в обязанности интервьюера?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Отбор домохозяйств, отвечающих требуемым характеристикам",
                  "right": true
                },
                {
                  "label": "Получение согласия респондента на участие в наблюдении",
                  "right": false
                },
                {
                  "label": "Заполнение бланков вопросников",
                  "right": false
                },
                {
                  "label": "Подготовка отчетности по результатам опросов",
                  "right": false
                }]
            },
            {
              "question":"Какого из перечисленных стилей поведения НЕ стоит придерживаться во время интервью?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"«Ответственный человек»",
                  "right": false
                },
                {
                  "label": "«Человек, вызывающий доверие»",
                  "right": false
                },
                {
                  "label": "«Свой человек»",
                  "right": true
                },
                {
                  "label": "«Человек, с которым интересно, приятно поговорить»",
                  "right": false
                }]
            },
            {
              "question":"Отметьте, какие из следующих положений являются нарушением правил заполнения вопросников? ",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Задавать вопросы в том порядке, в котором они указаны в вопроснике",
                  "right": false
                },
                {
                  "label": "Обязательно зачитывать респонденту все варианты ответов",
                  "right": false
                },
                {
                  "label": "Соблюдать указания по технике заполнения вопросников, следовать условным обозначениям",
                  "right": false
                },
                {
                  "label": "Своевременно использовать при опросе респондентов соответствующие карточки",
                  "right": false
                },
                {
                  "label": "При затруднении с ответом подсказать респонденту наиболее часто выбираемые варианты",
                  "right": true
                }]
            },
            {
              "question":"Как следует читать текст (заключенный в круглые скобки)?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Не зачитывать вслух респонденту",
                  "right": false
                },
                {
                  "label": "Обратить особое внимание респондента",
                  "right": false
                },
                {
                  "label": "Определять необходимость зачитать в зависимости от ситуации (от полученной ранее информации)",
                  "right": true
                },
                {
                  "label": "Всегда зачитывать респонденту полный текст вопроса",
                  "right": false
                }]
            },
            {
              "question":"Основную часть беседы следует начать с:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"представления ",
                  "right": false
                },
                {
                  "label": "гарантий конфиденциальности",
                  "right": false
                },
                {
                  "label": "важности проводимого исследования",
                  "right": false
                },
                {
                  "label": "объяснения процедуры интервью",
                  "right": true
                }]
            },
            {
              "question":"Какая информация должна быть внесена интервьюером в вопросники, находясь вне домохозяйства, по завершении интервью?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Поправки по ответам респондента",
                  "right": false
                },
                {
                  "label": "Предполагаемые ответы респондента на пропущенные вопросы",
                  "right": false
                },
                {
                  "label": "Замечания по качеству вопросов и интервью в специальные разделы вопросников",
                  "right": true
                },
                {
                  "label": "Работа завершена, никакая информация более не регистрируется",
                  "right": false
                }]
            },
            {
              "question":"Какой текст из вопросника НЕ должен зачитываться респонденту? ",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Текст, набранный маленькими буквами ",
                  "right": false
                },
                {
                  "label": "Текст, набранный большими буквами",
                  "right": true
                },
                {
                  "label": "Текст, набранный жирным шрифтом ",
                  "right": false
                },
                {
                  "label": "Текст, заключенный в круглые скобки ",
                  "right": false
                }]
            },
            {
              "question":"Какими должны быть действия интервьюера в случае, когда план наблюдения не выполнен, а основной и базовый списки отобранных домохозяйств исчерпаны?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Обойти еще раз домохозяйства, отказавшиеся от участия в наблюдении",
                  "right": false
                },
                {
                  "label": "Попробовать привлечь к участию в наблюдении домохозяйства, проживающие по адресам, которые не были отобраны",
                  "right": false
                },
                {
                  "label": "Оперативно передать инструктору сведения о невыполнении плана наблюдения",
                  "right": true
                },
                {
                  "label": "Обратиться к родным и знакомым с целью их привлечения к участию в наблюдении",
                  "right": false
                }]
            }
          ]
        },{
          "caption":"group2",
          "qUse":"all",
          "questions":[
            {
              "question":"В каком из домохозяйств присутствуют лица, которых не следует учитывать в составе домохозяйства?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Бабушка, дедушка и временно проживающий с ними внук",
                  "right": false
                },
                {
                  "label": "Супружеская пара с ребенком и гувернантка",
                  "right": true
                },
                {
                  "label": "Супружеская пара, сын на срочной службе в армии",
                  "right": false
                },
                {
                  "label": "Супружеская пара, дочь учится в институте в другом городе",
                  "right": false
                }]
            },
            {
              "question":"Какие возрастные ограничения по определению ответственного лица существуют в наблюдении?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Член домохозяйства 18 лет и более",
                  "right": false
                },
                {
                  "label": "Член домохозяйства, старший по возрасту",
                  "right": false
                },
                {
                  "label": "Член домохозяйства не моложе 16 лет",
                  "right": true
                },
                {
                  "label": "Член домохозяйства с датой рождения, наиболее близкой к дате опроса",
                  "right": false
                }]
            },
            {
              "question":"Порядковый номер семейной единицы в домохозяйстве:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"отражает степень родства между членами домохозяйства",
                  "right": false
                },
                {
                  "label": "присваивается единый супругам и их детям, не состоящим в браке, вне зависимости от возраста",
                  "right": true
                },
                {
                  "label": "проставляется от младшего к старшему члену домохозяйства",
                  "right": false
                },
                {
                  "label": "проставляется от старшего к младшему члену домохозяйства",
                  "right": false
                }]
            },
            {
              "question":"Индивидуальный вопросник обязательно заполняется на лиц:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"отсутствующих в связи с прохождением военной службы по призыву или контракту",
                  "right": false
                },
                {
                  "label": "отсутствующих менее 18 месяцев",
                  "right": false
                },
                {
                  "label": "до 16-ти лет, если на них получалось пособие ",
                  "right": false
                },
                {
                  "label": "внесших наибольший вклад в общий бюджет домохозяйства в прошлом году",
                  "right": true
                }]
            },
            {
              "question":"Укажите, на кого из детей должен быть заполнен раздел 2 Вопросника для домохозяйства?",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"Родился 15 января 2017 года",
                  "right": false
                },
                {
                  "label": "Исполнилось 16 лет 31 декабря 2016 года",
                  "right": false
                },
                {
                  "label": "Родился 31 декабря 2016 года",
                  "right": true
                },
                {
                  "label": "Исполнилось 16 лет 1 февраля 2017 года",
                  "right": true
                }]
            },
            {
              "question":"Какой код проставляется ребенку по строке «тип семейной единицы»?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Одиночка",
                  "right": false
                },
                {
                  "label": "Переносится из раздела 1 «Состав домохозяйства»",
                  "right": true
                },
                {
                  "label": "Ребенок, находящийся на попечении",
                  "right": false
                },
                {
                  "label": "Ребенок, проживающий с одним или обоими родителями",
                  "right": false
                }]
            },
            {
              "question":"Какие виды дохода относятся к нерегулярным?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Доходы от предпринимательской деятельности ",
                  "right": false
                },
                {
                  "label": "Доходы от сдачи собственности в аренду",
                  "right": false
                },
                {
                  "label": "Алименты",
                  "right": false
                },
                {
                  "label": "Страховые выплаты",
                  "right": true
                }]
            },
            {
              "question":"Какие из следующих видов доходов регистрируются в разделе 3 Вопросника для домохозяйства?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Помощь от органов социальной защиты",
                  "right": true
                },
                {
                  "label": "Доход от сельскохозяйственной деятельности",
                  "right": false
                },
                {
                  "label": "Доход от собственности",
                  "right": false
                },
                {
                  "label": "Доход в виде жилищной субсидии",
                  "right": false
                }]
            },
            {
              "question":"Обязательным видом расходов при наличии в домохозяйстве автомобиля является: ",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"страхование транспортного средства",
                  "right": false
                },
                {
                  "label": "страхование жизни водителя",
                  "right": false
                },
                {
                  "label": "страхование гражданской ответственности водителя ",
                  "right": true
                },
                {
                  "label": "страхование дееспособности водителя",
                  "right": false
                }]
            },
            {
              "question":"Сельскохозяйственная продукция, произведенная для личного потребления, НЕ учитывается, если:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"была безвозмездно передана в другие домохозяйства или на благотворительные цели",
                  "right": true
                },
                {
                  "label": "в получении этой продукции участвовали другие лица, не являющиеся членами домохозяйства",
                  "right": false
                },
                {
                  "label": "домохозяйство отдавало эту продукцию в обмен на услуги",
                  "right": false
                },
                {
                  "label": "затраты на производство превышают ее стоимость",
                  "right": false
                }]
            }]
        },{
          "caption":"group3",
          "qUse":"all",
          "questions":[
            {
              "question":"Статус основной деятельности респондента указывается по состоянию на:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"момент проведения опроса",
                  "right": false
                },
                {
                  "label": "31 декабря 2016",
                  "right": false
                },
                {
                  "label": "начало прошлого года",
                  "right": false
                },
                {
                  "label": "помесячно за весь прошлый год",
                  "right": true
                }]
            },
            {
              "question":"К категории «работающий по найму» НЕ относятся:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"члены производственного кооператива (артели)",
                  "right": true
                },
                {
                  "label": "лица, работающие на предприятии (в учреждении, организации)",
                  "right": false
                },
                {
                  "label": "лица, оказывающие платные услуги физическим лицам",
                  "right": false
                },
                {
                  "label": "лица, проходящие службу в органах внутренних дел",
                  "right": false
                }]
            },
            {
              "question":"Обучение считается бесплатным, если расходы по ведению учебного процесса:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"полностью оплачиваются из средств спонсора",
                  "right": false
                },
                {
                  "label": "осуществляются за счет средств бюджета государственного или муниципального уровня",
                  "right": true
                },
                {
                  "label": "возмещаются родителям или опекунам в полном объеме",
                  "right": false
                },
                {
                  "label": "осуществляются за счет предприятия",
                  "right": false
                }]
            },
            {
              "question":"Какой категории респондентов задается вопрос о получении выплат по уходу за другими лицами?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Не работающим лицам трудоспособного возраста",
                  "right": false
                },
                {
                  "label": "Неработающим пенсионерам",
                  "right": false
                },
                {
                  "label": "Не являющимся пенсионерами",
                  "right": true
                },
                {
                  "label": "Оказывающим услуги сиделки",
                  "right": false
                }]
            },
            {
              "question":"Каким категориям респондентов задается вопрос о назначении пенсии?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Мужчинам после 60 лет, женщинам после 55 лет",
                  "right": false
                },
                {
                  "label": "Лицам со страховым стажем не менее 15 лет",
                  "right": false
                },
                {
                  "label": "Лицам, достигшим минимального пенсионного возраста",
                  "right": false
                },
                {
                  "label": "Всем респондентам",
                  "right": true
                }]
            },
            {
              "question":"Лицам, заработавшим часть своего страхового стажа на работах с вредными, тяжелыми условиями труда, а также в районах Крайнего Севера, назначается:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"досрочная страховая пенсия",
                  "right": true
                },
                {
                  "label": "пенсия по государственному пенсионному обеспечению",
                  "right": false
                },
                {
                  "label": "социальная пенсия",
                  "right": false
                },
                {
                  "label": "страховая пенсия по инвалидности",
                  "right": false
                }]
            },
            {
              "question":"Что из перечисленного не входит в набор социальных услуг?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Предоставление путевок на санаторно-курортное лечение",
                  "right": false
                },
                {
                  "label": "Бесплатный проезд к месту лечения и обратно",
                  "right": false
                },
                {
                  "label": "Обеспечение минимальным набором продуктов питания",
                  "right": true
                },
                {
                  "label": "Дополнительная бесплатная медицинская помощь и обеспечение лекарственными средствами",
                  "right": false
                }]
            },
            {
              "question":"Какие из следующих видов деятельности относятся к доходным занятиям?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Владение акциями без непосредственного участия в экономической деятельности этой организации",
                  "right": false
                },
                {
                  "label": "Работа в собственном домашнем хозяйстве по производству товаров для продажи (обмена)",
                  "right": true
                },
                {
                  "label": "Учеба в образовательных организациях в случае получения стипендии",
                  "right": false
                },
                {
                  "label": "Производство продукции в личном подсобном хозяйстве только для собственного потребления",
                  "right": false
                }]
            },
            {
              "question":"При наличии у респондента нескольких мест работы основным считается:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"то, которое занимает больше времени",
                  "right": false
                },
                {
                  "label": "то, которое приносит больший доход",
                  "right": false
                },
                {
                  "label": "официально оформленное",
                  "right": false
                },
                {
                  "label": "то, которое считает основным сам респондент",
                  "right": true
                }]
            },
            {
              "question":"Информация о занятии члена домохозяйства предпринимательской деятельностью НЕ фиксируется, если:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"она не приносила дохода в прошлом году",
                  "right": false
                },
                {
                  "label": "эта же деятельность зафиксирована в Индивидуальном вопроснике другого члена домохозяйства",
                  "right": true
                },
                {
                  "label": "носит эпизодический характер",
                  "right": false
                },
                {
                  "label": "выполнялась самостоятельно",
                  "right": false
                }]
            }]
        }]
    }
  ]
}