var testStructure = {
  "tests":[
    {
      "testId":0,
      "caption":"final_test",
      "type":"section",
      "groups":[
        {
          "id": 5,
          "caption":"group1",
          "qUse":"all",
          "questions":[
            {
              "question": "Клиент заявляет, что цена на ваш товар слишком высока. В ответ на это вы соглашаетесь снизить цену на 5%.\n" +
              "В данном случае предложенная скидка – это… \n",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "аргумент  в процессе продажи",
                  "right": true
                },
                {
                  "label": "элемент переговорного процесса",
                  "right": false
                }]
            },{
              "question": "Суть переговоров заключается в том, чтобы…",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "давать и брать",
                  "right": false
                },
                {
                  "label": "совместно принимать решения",
                  "right": true
                },
                {
                  "label": "добиваться компромисса",
                  "right": false
                },
                  {
                  "label": "создавать положительный имидж честного переговорщика",
                  "right": false
                }]
            },{
              "question": "В ситуации коммерческих переговоров стратегия соперничества («наша сторона должна выиграть, а ваша – проиграть») является оптимальной?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "да, всегда",
                  "right": false
                },
                {
                  "label": "нет, не всегда",
                  "right": true
                }]
            },{
              "question": "У вас есть всего три часа на проведение переговорного процесса, включая подготовку к нему. Как вы распределите свое время?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "1 час – на подготовку, 2 часа – на ведение переговоров",
                  "right": false
                },
                {
                  "label": "1,5 часа – на подготовку, 1,5 часа – на ведение переговоров",
                  "right": false
                },
                {
                  "label": "2 часа на подготовку, 1 час – на переговоры",
                  "right": true
                }]
            },{
              "question": "К вам для переговоров приехала руководительница отдела продаж фирмы, производящей и поставляющей офисное оборудование. Вы заметили, что она подъехала к вашему офису на автомобиле представительского класса, на ней надет шикарный костюм от «Chanel», в руках у нее модная деловая сумка от «Vuitton». Какой вы сделаете вывод?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "Будете уверены, что имеете дело с первоклассной фирмой",
                  "right": false
                },
                {
                  "label": "Сочтете, что услуги этой компании будут стоить очень дорого",
                  "right": false
                },
                {
                  "label": "Не будете обращать внимания на то, какая у нее машина и как она одета, поскольку это не имеет отношения к предстоящим переговорам",
                  "right": true
                }]
            },{
              "question": "Согласны ли вы с утверждением: \n" +
              "«Для проведения успешных переговоров необходимо жесткое следование заранее намеченной тактике»?\n",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "да",
                  "right": false
                },
                {
                  "label": "нет",
                  "right": true
                }]
            },{
              "question": "Определение области торга и ценности уступок относится к следующему этапу переговоров…",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "изложение точек зрения и обсуждение",
                  "right": false
                },
                {
                  "label": "подготовка",
                  "right": true
                },
                {
                  "label": "поиск решения и выработка соглашения",
                  "right": false
                },
                  {
                  "label": "начало переговоров",
                  "right": false
                }]
            },{
              "question": "К параметрам торга относятся:",
              "score": -1,
              "status": "notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "цена",
                  "right": true
                },
                {
                  "label": "объем сделки в натуральном и денежном выражении",
                  "right": true
                },
                {
                  "label": "срок поставки",
                  "right": true
                },
                {
                  "label": "срок оплаты",
                  "right": true
                }]
            },{
              "question": "Вы для себя решили, что нижний предел цены, до которого вы можете опуститься при продаже своего автомобиля, составляет 500 000 рублей. В результате переговоров вы достигли именно этого, минимального для вас, уровня цены. Можно ли считать, что такой итог переговоров выгоден для вас?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "да",
                  "right": true
                },
                {
                  "label": "нет",
                  "right": false
                }]
            },{
              "question": "Ваш бизнес – консультации и проведение обучения по переговорному процессу. Вы получили запрос по электронной почте о проведении однодневного семинара для членов Городской Думы. Тема семинара полностью соответствует той, что вы традиционно проводите, и специальной подготовки вам не потребуется. Что вы сделаете?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "назовете стандартную цену за семинар, которая заявлена на вашем сайте",
                  "right": false
                },
                {
                  "label": "назовете цену на 15% ниже стандартной",
                  "right": false
                },
                {
                  "label": "назовете цену на 50% выше стандартной и попросите отдельно оплатить  подготовку",
                  "right": false
                },
                {
                  "label": "запросите список участников",
                  "right": true
                }]
            },{
              "question": "Назовите область обсуждения (или «арену переговоров»).\n" +
              "Покупатель готов приобрести товар максимум за 1000 рублей. Его желаемой ценой является 500 рублей. Для продавца желаемая цена продажи – 1300 рублей. Минимальная цена, за которую продавец готов отдать товар, составляет 900 рублей.\n",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "500 – 1000 рублей",
                  "right": false
                },
                {
                  "label": "500 – 900 рублей",
                  "right": false
                },
                {
                  "label": "900 – 1000 рублей",
                  "right": true
                },{
                  "label": "900– 1300 рублей",
                  "right": false
                }]
            },{
              "question": "Наиболее выгодные варианты уступок, которые вы можете сделать,  возможны в случае (-ях):",
              "score": -1,
              "status": "notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "низкой цены уступки для вас (низкие затраты, незначительные усилия)",
                  "right": true
                },
                {
                  "label": "низкой ценности уступки для партнера",
                  "right": false
                },
                {
                  "label": "высокой ценности вашей уступки для партнера",
                  "right": true
                }]
            },{
              "question": "Вы достали билет на концерт вашего любимого исполнителя и попросили няню задержаться сверх положенного времени с вашим трехлетним сыном. Обычно вы оплачиваете каждый сверхурочный час по ставке на 30% выше обычной. Но на этот раз няня сказала, что вряд ли сможет вас выручить. Однако отказ не был категоричным, и вам показалось, что она ждет от вас повышения оплаты. Что вы сделаете?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "предложите более высокую цену, но оговорите, что это касается лишь данного случая",
                  "right": false
                },
                {
                  "label": "скажете, что у вас есть очень веские причины, чтобы просить ее об этой услуге",
                  "right": false
                },
                {
                  "label": "спросите, какие у нее есть идеи о разрешении этой ситуации",
                  "right": true
                }]
            },{
              "question": "Вы ведете переговоры с поставщиком комплектующих для вашего производства. Вы уже получили альтернативное предложение от другого поставщика. \n" +
              "Как вы поступите, если настоящие переговоры пойдут трудно?\n",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "сразу заявите об альтернативном предложении, чтобы снизить аппетиты другой стороны",
                  "right": false
                },
                {
                  "label": "не будете вообще об этом говорить в ходе переговоров",
                  "right": false
                },
                {
                  "label": "используете этот факт как последний аргумент в защиту своей позиции",
                  "right": true
                }]
            },{
              "question": "Согласны ли вы с утверждением?\n" +
              "Основные приемы ведения торга – повышение видимой стоимости и ценности уступки, которую вы делаете партнеру, и снижение видимой стоимости и ценности уступки, которую делает партнер.\n",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "да",
                  "right": true
                },
                {
                  "label": "нет",
                  "right": false
                }]
            },{
              "question": "Как лучше всего поступить, если партнер в условиях цейтнота использует прием «выдвижение требований в последний момент»?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "согласиться с требованием, чтобы спасти сделку",
                  "right": false
                },
                {
                  "label": "выдвинуть встречное требование",
                  "right": false
                },
                {
                  "label": "напомнить, что об этом условии речь не шла, и что его надо обсуждать отдельно, если партнер на нем настаивает",
                  "right": true
                }]
            },{
              "question": "Как лучше всего поступить, если в процессе переговоров партнер прерывает вас, повышает тон голоса?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "сделать вид, что вы ничего не замечаете и спокойно продолжать обсуждение",
                  "right": false
                },
                {
                  "label": "поступить так же, как он",
                  "right": false
                },
                {
                  "label": "в твердой форме высказать свое мнение о недопустимости использования личных нападок",
                  "right": true
                }]
            },{
              "question": "Как лучше всего поступить, если в процессе переговоров ваш партнер стремится максимально завышать требования и как можно дольше отстаивать свою крайнюю позицию?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "сообщить, что вы понимаете, что партнер сознательно стремится вас прессинговать",
                  "right": false
                },
                {
                  "label": "доказать необоснованность требований, подтвердить свои доводы фактами из независимых источников",
                  "right": true
                },
                {
                  "label": "играть роль «робкого ягненка», а затем «показать клыки» ",
                  "right": false
                },
                {
                  "label": "предупредить, что если партнер не изменит свою позицию, то вы прекратите переговоры",
                  "right": false
                }]
            },{
              "question": "Как лучше всего поступить, если в процессе переговоров ваш партнер упирает на безвыходность своей ситуации, пытаясь вызвать у вас сочувствие своим «бедственным положением»?",
              "score": -1,
              "status": "notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "сообщить, что вы понимаете, что партнер сознательно стремится ввести вас в заблуждение",
                  "right": false
                },
                {
                  "label": "выразите сочувствие его ситуации",
                  "right": true
                },
                {
                  "label": "твердо объяснить, почему не можете изменить свои условия",
                  "right": true
                }]
            }
          ]
        }
      ]
    },
    {
      "testId":1,
      "caption":"final_test",
      "type":"section",
      "groups":[{
        "id": 2,
          "caption":"group2",
          "qUse":"all",
          "questions":[ {
              "question": "Какие высказывания относятся к переговорному процессу?",
              "score": -1,
              "status": "notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "Я убеждаю клиента, что предлагаемый мной товар полностью соответствует его потребностям.",
                  "right": false
                },
                {
                  "label": "Я строю презентацию продукта на основе выявленной потребности.",
                  "right": false
                },
                {
                  "label": "Я договариваюсь с клиентом о сокращении сроков поставки на условиях 100% предоплаты. ",
                  "right": true
                },
                {
                  "label": "Я убеждаю клиента, что цена продукта соответствует его качеству.",
                  "right": false
                },
                {
                  "label": "Я обсуждаю с клиентом сроки сервисного обслуживания и соглашаюсь снизить цену в обмен на отказ от гарантийного обслуживания.",
                  "right": true
                }]
            },{
              "question": "Отметьте обязательные условия для ведения переговорного процесса (без этих условий процесс переговоров невозможен).",
              "score": -1,
              "status": "notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "Обе стороны заинтересованы в сделке",
                  "right": true
                },
                {
                  "label": "Обе стороны имеют альтернативные предложения",
                  "right": false
                },
                {
                  "label": "Обе стороны настроены на поиск взаимовыгодного решения",
                  "right": false
                },
                {
                  "label": "Обе стороны уполномочены менять условия соглашения",
                  "right": true
                },
                {
                  "label": "Цель одной из сторон – заставить другую сторону принять ее условия в неизменном виде",
                  "right": false
                }]
            },{
              "question": "Что является «золотым правилом» переговорного процесса? ",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "У вас не будет второго шанса произвести первое благоприятное впечатление.",
                  "right": false
                },
                {
                  "label": "Не вступайте в переговоры, пока вас к этому не вынудили.",
                  "right": true
                },
                {
                  "label": "Не «дарите» уступки: отдавайте уступку в обмен на уступку другой стороны.",
                  "right": false
                },
                {
                  "label": "Ориентируясь на долгосрочное сотрудничество, стремитесь к взаимовыгодному решению.",
                  "right": false
                }]
            },{
              // "question": "Компромисс целесообразен,  если вы ведете переговоры по:",
              "question": "В каких случаях целесообразен компромисс?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  // "label": "Одному параметру сделки ",
                  "label": "Если ведутся переговоры по одному параметру сделки",
                  "right": true
                },
                {
                  // "label": "По нескольким параметрам одновременно",
                  "label": "Если ведутся переговоры по нескольким параметрам одновременно",
                  "right": false
                },
                {
                  // "label": "Компромисс целесообразен в любой ситуации",
                  "label": "В любой ситуации",
                  "right": false
                },
                {
                  "label": "Ни при каких условиях",
                  "right": false
                }]
            },{
              "question": "Как лучше всего поступить, если переговоры проходят в неприятной шумной обстановке? Они прерываются телефонными звонками, приемом посетителей… Вас могут посадить на низкое кресло или лицом к свету…",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "сделать вид, что ничего страшного не происходит",
                  "right": false
                },
                {
                  "label": "предложить изменить условия проведения переговоров",
                  "right": true
                },
                {
                  "label": "высказать свою неудовлетворенность",
                  "right": false
                },
                {
                  "label": "прекратить переговоры",
                  "right": false
                }]
            },{
              "question": "Какой из этапов переговорного процесса в наибольшей степени определяет его успех?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "подготовка",
                  "right": true
                },
                {
                  "label": "начало переговоров",
                  "right": false
                },
                {
                  "label": "изложение точек зрения и обсуждение",
                  "right": false
                },
                {
                  "label": "поиск решения и выработка соглашения",
                  "right": false
                }]
            },{
              "question": "Какие  элементы подготовки к переговорам в условиях острой нехватки времени можно проигнорировать?",
              "score": -1,
              "status": "notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "Формулирование моих целей и интересов («я их и так знаю»)",
                  "right": false
                },
                {
                  "label": "Анализ предполагаемых целей другой стороны («их можно выявить в начале переговоров»)",
                  "right": false
                },
                {
                  "label": "Составление различных вариантов соглашения («в ходе переговоров их предложит другая сторона, и я их проанализирую»)",
                  "right": false
                },
                {
                  "label": "Закупка шампанского и сувениров в честь удачно подписанного соглашения («это успеется»)",
                  "right": true
                },
                {
                  "label": "Подбор фактов, подтверждающих легитимность моих заявлений («они и так всем известны»)",
                  "right": false
                },
                {
                  "label": "Подготовка НАОС («если переговоры закончатся провалом, тогда и буду думать, что делать дальше»)",
                  "right": false
                },
                {
                  "label": "Проект будущего договора с банковскими реквизитами сторон",
                  "right": true
                }]
            },{
              "question": "Положительная область обсуждения на переговорах возникает в том случае, когда:",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "точка сопротивления продавца находится выше точки сопротивления покупателя.",
                  "right": false
                },
                {
                  "label": "точка сопротивления продавца находится ниже точки сопротивления покупателя.",
                  "right": true
                }]
            },{
              "question": "Назовите область обсуждения (или «арену переговоров»). Минимальная цена, за которую продавец готов отдать товар, составляет 170 руб. Его желаемой ценой является 210 руб. Точка сопротивления покупателя – 160 руб. Его целевая точка – 120 руб. ",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "120–210 руб.",
                  "right": false
                },
                {
                  "label": "120–160 руб.",
                  "right": false
                },
                {
                  "label": "120–170 руб.",
                  "right": false
                },
                {
                  "label": "160–170 руб.",
                  "right": false
                },
                {
                  "label": "Область обсуждения отсутствует",
                  "right": true
                }]
            },{
              "question": "Ваша компания производит механические узлы для металлообрабатывающих станков. В лучшие годы вам удавалось продать не более 3 тыс. комплектов различным производителям.  Благодаря значительным усилиям вам удалось получить согласие на 10-минутную встречу с руководителем крупнейшего в стране станкостроительного холдинга. Вам пришлось ждать более 20 минут в приемной, затем вас пригласили к нему в кабинет. Без должных элементов делового этикета руководитель холдинга заявляет: «Я очень занят, поэтому давайте сразу к делу. Какова ваша лучшая цена за поставку  5 тысяч комплектов узлов нашему холдингу в следующем году?» Что вы сделаете?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "Назовете низшую цену, поскольку у вас вряд ли будет второй шанс получить такое предложение.",
                  "right": false
                },
                {
                  "label": "Назовете высокую цену.",
                  "right": false
                },
                {
                  "label": "Оставите свою визитку, сказав: «Пожалуйста, позвоните мне, когда у Вас будет возможность для более продолжительного обсуждения этого вопроса».",
                  "right": false
                },
                {
                  "label": "Назовете низшую цену плюс 5%.",
                  "right": true
                }]
            },{
              "question": "В ходе предстоящих переговоров планируется обсудить девять вопросов, в том числе условия оплаты. Вы ожидаете, что именно по этому вопросу вам будет труднее всего найти взаимоприемлемое решение. <br/>Как вы построите переговорный процесс?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "Начнете переговоры с обсуждения условий оплаты.",
                  "right": false
                },
                {
                  "label": "Перенесете этот вопрос на  середину переговорного процесса.",
                  "right": false
                },
                {
                  "label": "Будете обсуждать его последним.",
                  "right": true
                }]
            },{
              "question": "Закончите предложение: <br/>В процессе переговоров в ответ на требование уступки надо… ",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "Безмятежно улыбаться",
                  "right": false
                },
                {
                  "label": "Обосновывать  вашу позицию",
                  "right": false
                },
                {
                  "label": "Напоминать правила ведения переговорного процесса",
                  "right": false
                },
                {
                  "label": "Выдвигать встречное требование ",
                  "right": true
                }]
            },{
              "question": "Обмен уступками наиболее эффективен, когда интересы сторон…",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "противоположны – максимальный выигрыш для одного партера означает максимальный проигрыш для другого.",
                  "right": false
                },
                {
                  "label": "совпадают – максимальный выигрыш для одного партнера означает максимальный выигрыш для другого.",
                  "right": false
                },
                {
                  "label": "разнонаправлены – выигрыши, которые могут получить партнеры по разным параметрам, значительно  отличаются.",
                  "right": true
                }]
            },{
              "question": "Вас поставили в известность, что стоимость предлагаемых вами услуг по разработке нового дизайна и оборудованию офиса клиента превышает выделенный на это  бюджет. Что вы сделаете?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "Будете настаивать на этой стоимости, утверждая, что это не затраты, а инвестиции, и они себя обязательно окупятся.",
                  "right": false
                },
                {
                  "label": "Проанализируете смету на переоборудование офиса и определите, где можно использовать более дешевые материалы.",
                  "right": true
                },
                {
                  "label": "Выясните, каков точный размер бюджета, и согласитесь с ним, если он отличается от вашего предложения не более чем на 5-7%.",
                  "right": false
                }]
            },{
              "question": "Как лучше всего поступить, если партнер использует позиционное давление?",
              "score": -1,
              "status": "notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "разобраться в причинах возникновения спорных моментов",
                  "right": true
                },
                {
                  "label": "сообщить, что вы считаете такое поведение партнера недопустимым",
                  "right": false
                },
                {
                  "label": "разорвать отношения",
                  "right": false
                },
                {
                  "label": "объяснить, почему вы не можете принять условия партнера в таком виде",
                  "right": true
                }]
            },{
              "question": "На этапе подготовки вы сформировали 3 варианта соглашения. Как вы поступите в ходе переговорного процесса?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "Изложите сразу все три варианта, чтобы сэкономить время и партнер смог быстро оценить, что для него предпочтительне.",
                  "right": false
                },
                {
                  "label": "Предложите для рассмотрения 2 варианта, а 3-й оставите «про запас».",
                  "right": false
                },
                {
                  "label": "Будете выдвигать предложения по одном.",
                  "right": true
                }]
            },{
              "question": "Какую речевую технологию вы выберете на стадии выдвижения предложений (этап «Поиск решения»)?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "«Мы сможем вам поставить оборудование в течение 5 рабочих дней»",
                  "right": false
                },
                {
                  "label": "«Если вы оплатите завтра, то мы, вероятно, сможем поставить оборудование в течение 5 рабочих дней»",
                  "right": true
                },
                {
                  "label": "«Мы сможем вам поставить оборудование в течение 5 рабочих дней, если вы оплатите завтра»",
                  "right": false
                }]
            },{
              "question": "Вы ожидали, что партнер назовет цену 20 долларов за единицу продукции. Однако он сразу же сделал вам очень выгодное предложение – 15 долларов. Как будет правильно?",
              "score": -1,
              "status": "notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "Согласиться с этой ценой ",
                  "right": false
                },
                {
                  "label": "Не принимать это предложение",
                  "right": true
                }]
            },{
              "question": "Как лучше всего поступить, если есть вероятность, что партнер не собирается выполнять взятые на себя обязательства?",
              "score": -1,
              "status": "notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "отказаться от сотрудничества с данным партнером",
                  "right": false
                },
                {
                  "label": "перенести подписание контракта «до лучших времен» ",
                  "right": false
                },
                {
                  "label": "перед тем как подписать договор, четко сформулировать, что произойдет, если одна из сторон его не выполнит",
                  "right": true
                },
                {
                  "label": "занести в договор штрафные санкции за невыполнение взятых на себя обязательства",
                  "right": true
                }]
            }
          ]
        }
      ]
    }
  ]
}
