var testStructure = {
  "tests":[
    {
      "testId":0,
      "caption":"final_test",
      "type":"section",
      "groups":[
        {
          "id": 5,
          "caption":"group1",
          "qUse":"all",
          "questions":[{
              "question":"Как вы дадите понять, что слушаете абонента?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"«Говорите»",
                  "right": false
                },
                {
                  "label": "«Слушаю вас» ",
                  "right": true
                },
                {
                  "label": "«Алло»",
                  "right": false
                }]
            },{
              "question":"Если разговор прервался, кто должен перезвонить?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"инициатор разговора ",
                  "right": true
                },
                {
                  "label": "тот, кому позвонили",
                  "right": false
                },
                {
                  "label": "не имеет значения",
                  "right": false
                }]
            },{
              "question":"Закончите предложение.<br/><i>Умение принимать входящие звонки…</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"влияет на общее положение дел в компании ",
                  "right": true
                },
                {
                  "label": "сказывается только на отношениях с клиентами",
                  "right": false
                },
                {
                  "label": "формирует личный имидж принимающего звонки",
                  "right": false
                }]
            },{
              "question":"К телефону попросили сотрудника, которого нет на месте. Вы от его имени пообещали, что он перезвонит. Правильно ли вы поступили?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"да",
                  "right": true
                },
                {
                  "label": "нет",
                  "right": false
                }]
            },{
              "question":"Как лучше всего показать клиенту, что мы его услышали?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"сказать «я вас понял(-а)»",
                  "right": false
                },
                {
                  "label": "сказать «спасибо, я вас понял(-а)»",
                  "right": false
                },
                {
                  "label": "повторить слова клиента ",
                  "right": true
                }]
            },{
              "question":"Какой вопрос позволяет получить больше информации?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label":"Вы хотите отправить отдыхать ребенка к морю?",
                  "right": false
                },
                {
                  "label": "Куда вы хотите отправить ребенка отдыхать? ",
                  "right": true
                }]
            },{
              "question":"Продолжите утверждение:<br/><i>Консультируя клиента по телефону, надо стремиться…</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "дать как можно больше информации",
                  "right": false
                },
                {
                  "label": "уточнить его потребности и дать лишь необходимую информацию ",
                  "right": true
                }]
            },{
              "question":"С чего лучше всего начать телефонную презентацию товара или услуги клиенту?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "с наиболее ярких деталей и впечатляющих фактов",
                  "right": false
                },
                {
                  "label": "с того, что больше всего волнует клиента ",
                  "right": true
                },
                {
                  "label": "с положительных отзывов других клиентов",
                  "right": false
                }]
            },{
              "question":"Верно ли следующее утверждение?<br/><i>Чем больше говорит сотрудник в процессе презентации по телефону, тем лучше.</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "да ",
                  "right": false
                },
                {
                  "label": "нет ",
                  "right": true
                }]
            },{
              "question":"«Холодный звонок» имеет такое название, потому что:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "вам «холодно» отвечают",
                  "right": false
                },
                {
                  "label": "вы звоните незнакомому клиенту ",
                  "right": true
                },
                {
                  "label": "во время звонка у вас на лбу выступает холодный пот",
                  "right": false
                }]
            },{
              "question":"Перед «холодным» телефонным звонком необходимо собрать информацию о:",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "профиле деятельности компании ",
                  "right": true
                },
                {
                  "label": "корпоративной культуре",
                  "right": false
                },
                {
                  "label": "количестве людей, работающих в компании ",
                  "right": true
                },{
                  "label": "о стиле одежды, принятой в компании",
                  "right": false
                },
                {
                  "label": "месте компании на рынке ",
                  "right": true
                },
                {
                  "label": "финансовом положении компании",
                  "right": false
                },
                {
                  "label": "лице, ответственном за принятие решения по вашему вопросу ",
                  "right": true
                }]
            },{
              "question":"Выберите дополнительные цели разговора с клиентом, если вы первый раз звоните клиенту и основная цель звонка – назначить встречу. Учтите, что ваша компания – молодая, но уже громко заявившая о себе на рынке.",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "Познакомиться, рассказать клиенту о выгодах сотрудничества с вашей компанией. ",
                  "right": true
                },
                {
                  "label": "Сообщить, что вы молодая, но очень динамично развивающаяся компания.",
                  "right": false
                },
                {
                  "label": "Убедить в необходимости приобретения для нее ваших продуктов/услуг.",
                  "right": false
                }]
            },{
              "question":"Верно ли следующее утверждение?<br/><i>При разговоре с секретарем необходимо проявлять максимум уверенности и давать ему минимум информации.</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "да",
                  "right": true
                },
                {
                  "label": "нет",
                  "right": false
                }]
            },{
              "question":"Верно ли следующее утверждение?<br/><i>При разговоре с секретарем необходимо быть предельно вежливым, доброжелательным, сделать его своим союзником.</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "да",
                  "right": false
                },
                {
                  "label": "нет",
                  "right": true
                }]
            },{
              "question":"В процессе общения с клиентом необходимо умение налаживать и поддерживать отношение доверия. Завершите предложение.<br/><i>Доверие – это…</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "быть на короткой ноге с клиентом",
                  "right": false
                },
                {
                  "label": "отсутствие коммерческих секретов",
                  "right": false
                },
                {
                  "label": "открытость в общении ",
                  "right": true
                }]
            },{
              "question":"В начале телефонного разговора с клиентом обязательно:",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "поприветствовать клиента и представиться ",
                  "right": true
                },
                {
                  "label": "сформулировать цель звонка ",
                  "right": true
                },
                {
                  "label": "получить согласие на продолжение разговора ",
                  "right": true
                }]
            },{
              "question":"Клиент в разговоре с продавцом произнес: <i>«Вы знаете, мы готовы к повторному заказу, но я не знаю, сколько мне заказывать». </i><br/>Какой из приведенных ниже вопросов, на ваш взгляд, развивает контакт, помогает продвигаться к получению заказа?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "Вы хотели бы расширить ассортимент? ",
                  "right": true
                },
                {
                  "label": "Когда вы последний раз заказывали товар?",
                  "right": false
                },
                {
                  "label": "Когда товар закончился?",
                  "right": false
                }]
            },{
              "question":"Определите тип вопроса, который задает клиенту продавец.<br/><strong>Клиент:</strong> «Я считаю, что ваши цены не соответствуют качеству вашей продукции».<br/><strong>Продавец:</strong> <i>«То есть, вы считаете, что цена несколько завышена?».</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "альтернативный ",
                  "right": false
                },
                {
                  "label": "развивающий ",
                  "right": true
                }]
            },{
              "question":"Верно ли утверждение:<br/><i>При совершении «холодного звонка» нужно подробно и тщательно рассказать о всех преимуществах или выгодах продукта/услуги. </i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "да ",
                  "right": false
                },
                {
                  "label": "нет ",
                  "right": true
                }]
            },{
              "question":"Правильно ли продавец преодолевает возражение клиента:<br/><strong>Клиент:</strong> <i>«Я слышал, у вас цены выше, чем у других».</i><br/><strong>Продавец:</strong> <i>«Вы, видимо, плохо информированы, у нас цены гораздо ниже, чем у конкурентов».</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "да ",
                  "right": false
                },
                {
                  "label": "нет ",
                  "right": true
                }]
            },{
              "question":"Прочитайте возражение клиента и выберите наиболее подходящий ответ.<br/><strong>Клиент:</strong> <i>«К сожалению, я не смогу встретиться с вами в ближайшие две недели».</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "«Я понимаю, вы очень занятый человек. Давайте договоримся, я перезвоню через две недели, 14 апреля, и мы назначим время встречи, хорошо?» ",
                  "right": true
                },
                {
                  "label": "«Вы зря отказываетесь от встречи в ближайшее время. Через месяц наше выгодное предложение перестанет действовать».",
                  "right": false
                }]
            }
          ]
        }
      ]
    },
    {
      "testId":1,
      "caption":"final_test",
      "type":"section",
      "groups":[{
        "id": 55,
          "caption":"group2",
          "qUse":"all",
          "questions":[{
              "question":"Ниже приводятся фразы, которые клиенты услышали в ходе телефонного общения с представителями компании. Отметьте варианты, которые не рекомендуется использовать, беседуя с клиентом.",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label":"«Его сегодня не будет. Может, ему что-то передать?» ",
                  "right": true
                },
                {
                  "label": "«Доброе утро, я вас слушаю»",
                  "right": true
                },
                {
                  "label": "«Извините, я этим не занимаюсь. Вам нужно позвонить в отдел заказов»",
                  "right": true
                }]
            },
            {
              "question":"Кто кладет трубку первым?",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "позвонивший",
                  "right": true
                },
                {
                  "label": "тот, кому позвонили",
                  "right": false
                },
                {
                  "label": "не имеет значения",
                  "right": false
                }]
            },
            {
              "question":"Если вы разговариваете по телефону, и в это время зазвонил второй аппарат, вы должны:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "прервать разговор с первым абонентом и ответить второму",
                  "right": false
                },
                {
                  "label": "сообщить первому абоненту, что вам нужно ответить на другой звонок и ответить второму абоненту",
                  "right": false
                },
                {
                  "label": "спросить разрешения у первого абонента ответить на второй звонок, поблагодарить за согласие и очень кратко ответить второму абоненту",
                  "right": true
                }]
            },
            {
              "question":"При приеме телефонного сообщения в бланке не нужно указывать: ",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "дополнительную информацию",
                  "right": false
                },
                {
                  "label": "длительность разговора",
                  "right": true
                },
                {
                  "label": "время и дату звонка",
                  "right": false
                },
                {
                  "label": "кто принял сообщение",
                  "right": false
                }]
            },
            {
              "question":"Чтобы убедиться, что вы правильно поняли клиента, надо по ходу разговора…",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "записывать его слова",
                  "right": false
                },
                {
                  "label": "повторять то, что он сказал, своими словами",
                  "right": true
                },
                {
                  "label": "говорить: «Я вас понимаю»",
                  "right": false
                }]
            },
            {
              "question":"Отметьте, какие из этих вопросов являются закрытыми.",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "Пользуетесь ли вы сами пластиковой картой? ",
                  "right": true
                },
                {
                  "label": "Что вас не устраивает? ",
                  "right": false
                },
                {
                  "label": "А важно для вас, чтобы были какие-либо ограничения по снятию денежных сумм, например, в день?",
                  "right": true
                }]
            },
            {
              "question": "Верно ли утверждение:<br/> <i>Прежде чем давать консультацию, надо уточнить потребности, задавая вопросы.</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "да",
                  "right": true
                },
                {
                  "label": "нет",
                  "right": false
                }]
            },
            {
              "question": "Верно ли утверждение:<br/><i>Презентацию следует начинать с самых ярких деталей и убедительных фактов.</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "да",
                  "right": false
                },
                {
                  "label": "нет",
                  "right": true
                }]
            },
            {
              "question": "Верно ли утверждение:<br/><i>Презентация более эффективна, если строится в режиме монолога.</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "да",
                  "right": false
                },
                {
                  "label": "нет",
                  "right": true
                }]
            },
            {
              "question": "Отметьте правильные ответы:<br/><i>При подготовке к «холодному звонку» необходимо…</i>",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "разбить потенциальных клиентов на группы ",
                  "right": true
                },
                {
                  "label": "собрать информацию о потенциальном клиенте",
                  "right": true
                },
                {
                  "label": "сформулировать для себя цели звонка",
                  "right": true
                },
                {
                  "label": "составить план предстоящего разговора",
                  "right": true
                }]
            },
            {
              "question": "Рекламное агентство работает на рынке уже 5 лет. Менеджеру по работе с клиентами этого агентства поставлена задача расширения круга клиентов. Он собирается сделать «холодный звонок» в компанию потенциального заказчика, который хорошо знаком с рынком рекламных услуг. Отметьте цели, которые будут для менеджера дополнительными.",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "Назначить встречу.",
                  "right": false
                },
                {
                  "label": "Узнать, чем вызвано отсутствие сотрудничества.",
                  "right": true
                },
                {
                  "label": "Получить заказ.",
                  "right": true
                },
                {
                  "label": "Подчеркнуть конкурентные преимущества агентства.",
                  "right": true
                },
                {
                  "label": "Познакомиться, рассказать потенциальному клиенту о выгодах сотрудничества с компанией.",
                  "right": true
                },
                {
                  "label": "Заинтересовать в сотрудничестве. ",
                  "right": true
                }]
            },
            {
              "question": "При использовании тактики «Взять секретаря в союзники» необходимо…",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "постараться предварительно узнать, как зовут человека, ответственного за принятие решения",
                  "right": false
                },
                {
                  "label": "сформулировать свой вопрос так, чтобы секретарь не смогла сама по нему принять решение",
                  "right": false
                },
                {
                  "label": "обратившись к секретарю по имени, узнать, когда вам лучше позвонить ответственному лицу, чтобы застать его на месте (если вас сразу не соединяют)",
                  "right": true
                }]
            },
            {
              "question": "Отметьте верные утверждения.",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "Когда клиент испытывает доверие, он делится всей имеющейся у него информацией с продавцом.",
                  "right": false
                },
                {
                  "label": "Когда клиент испытывает доверие, он открыт к восприятию и принятию информации, идущей от продавца. ",
                  "right": true
                }]
            },
            {
              "question": "Верно ли утверждение?<br/><i>Когда мы делаем «холодный звонок», необходимо поинтересоваться, удобно ли клиенту сейчас говорить.</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "да",
                  "right": true
                },
                {
                  "label": "нет",
                  "right": false
                }]
            },
            {
              "question": "Выберите вариант информации, которая не может быть использована для удержания интереса клиента:",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "отзыв кого-то из другой компании, кого клиент знает",
                  "right": false
                },
                {
                  "label": "изменения, произошедшие в вашем бизнесе с момента последнего разговора с покупателем",
                  "right": false
                },
                {
                  "label": "ссылка на неудачный опыт клиента при общении с вашими конкурентами",
                  "right": true
                },
                {
                  "label": "содержание письма, которое вы недавно написали клиенту",
                  "right": false
                }]
            },
            {
              "question": "Прочитайте фразу клиента и выберите лучший вариант уточняющего вопроса.<br/><strong>Клиент:</strong><i> «Я считаю, что ваши цены не соответствуют качеству вашей продукции».</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "«Не соответствует качеству? А какой должна быть цена, по вашему мнению?»",
                  "right": false
                },
                {
                  "label": "«Не соответствует качеству? Поясните, пожалуйста, на основании чего вы пришли к такому выводу?»",
                  "right": true
                },
                {
                  "label": "«Я понял. Это главное, что вас не устраивает?»",
                  "right": false
                }]
            },
            {
              "question": "Клиент в разговоре со страховым агентом произнес: «Я вообще не верю страховщикам». Агент может задать клиенту уточняющие и развивающие вопросы. Какие из приведенных ниже вопросов являются уточняющими?",
              "score":-1,
              "status":"notanswered",
              "type": "multi",
              "answers":[
                {
                  "label": "Вообще не верите? По какой причине?",
                  "right": true
                },
                {
                  "label": "Вы хотите сказать, что вам пришлось столкнуться с недобросовестными страховщиками?",
                  "right": false
                },
                {
                  "label": "А что произошло, после чего вы перестали им верить?",
                  "right": true
                }]
            },
            {
              "question": "Закончите предложение. <br/><i>При общении по телефону у нас нет возможности долго расписывать преимущества или выгоды товара/услуги клиенту. Лучше всего использовать цепочку: </i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "«вопрос – выгода – вопрос»",
                  "right": true
                },
                {
                  "label": "«выгода – вопрос – выгода»",
                  "right": false
                },
                {
                  "label": "«выгода – выгода – вопрос»",
                  "right": false
                }]
            },
            {
              "question": "Преодолевая возражения по телефону, продавцу лучше всего…",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "сразу приводить контраргументы",
                  "right": false
                },
                {
                  "label": "оправдываться, а потом приводить аргументы",
                  "right": false
                },
                {
                  "label": "принимать возражение (присоединяться к возражению), затем приводить аргументы",
                  "right": true
                }]
            },
            {
              "question": "Прочитайте возражение клиента и выберите наиболее подходящий ответ.<br/><strong>Клиент: </strong><i>«Поговорите с моим подчиненным».</i>",
              "score":-1,
              "status":"notanswered",
              "type": "single",
              "answers":[
                {
                  "label": "«Нет, давайте лучше обсудим предложение лично с вами. Когда вам удобнее, в четверг или в пятницу?»",
                  "right": false
                },
                {
                  "label": "«Как показывает опыт, подчиненные не принимают решений о сотрудничестве. Наша встреча у вас займет не более 15 минут. Давайте встретимся, например, во вторник после обеда, или вам удобнее в среду утром?»",
                  "right": false
                },
                {
                  "label": "«Я обязательно это сделаю. И все же некоторые соображения по поводу новой услуги может оценить только руководитель предприятия. К тому же во время личной встречи мы будем застрахованы от эффекта «испорченного телефона». Мы могли бы встретиться в среду или в четверг на этой неделе. Вам когда удобнее?»",
                  "right": true
                }]
            }
          ]
        }
      ]
    }
  ]
}
