{
  "glossary":[
    {
      "termin":"Логистика",
      "description":"Наука о планировании и эффективном управлении материальными потоками и связанными с ними нематериальными и финансовыми потоками от источников снабжения до конечного потребителя с оптимальными издержками. Динамичная наука, наука о движении потоков, точнее – об управлении потоками в больших системах."
    },
    {
      "termin":"Логистический поток",
      "description":"Направленное движение совокупности материально-вещественных, финансовых, информационных и других видов ресурсов."
    },
    {
      "termin":"Материальный поток",
      "description":"Находящиеся в состоянии движения материальные ресурсы, незавершенное производство и готовая продукция, к которым применяются логистические операции."
    },
    {
      "termin":"Логистическая система",
      "description":"Система с обратной связью, состоящая из нескольких подсистем, выполняющая логистические функции и имеющая развитые связи с внешней средой."
    },
    {
      "termin":"Логистическая цепь",
      "description":"Линейно-упорядоченное множество участников движения материальных потоков, взаимосвязанно действующих в рамках логистической системы."
    },
    {
      "termin":"Снабженческая логистика",
      "description":"Обеспечение предприятия материальными ресурсами с максимальной экономической эффективностью и качеством."
    },
    {
      "termin":"Производственная логистика",
      "description":"Управление материальными потоками при движении от первичного источника сырья до готовой продукции с целью снижения затрат и повышения качества продукции."
    },
    {
      "termin":"Складская логистика",
      "description":"Оптимизация движения материальных потоков во время реализации комплекса взаимосвязанных операций с целью хранения. Управление размещением на хранение, хранением, пополнением и выдачей материальных ресурсов потребителям."
    },
    {
      "termin":"Распределительная логистика",
      "description":"Комплекс взаимосвязанных функций, реализуемых в процессе распределения материального, финансового и информационного потоков между потребителями. Комплекс взаимосвязанных функций, реализуемых в процессе распределения материального при оптовой продаже товаров."
    },
    {
      "termin":"Транспортная логистика",
      "description":"Управление перемещением грузов с помощью транспортных средств с оптимальными издержками."
    },
    {
      "termin":"Информационная логистика",
      "description":"Эффективное распределение потока данных, которые сопровождают материальный поток во время его перемещения."
    },
    {
      "termin":"Логистические затраты",
      "description":"Расходы на выполнение логистических задач: управление движением материальных потоков по всей логистической системе – от поставщиков сырья через производственное предприятие до конечного потребителя."
    },
    {
      "termin":"Материальные запасы",
      "description":"Продукция производственно-технического назначения, ожидающая вступления в процесс потребления."
    },
    {
      "termin":"Точка перезаказа",
      "description":"Момент времени, когда величина текущего запаса достигает величины, при которой необходимо делать новый заказ."
    },
    {
      "termin":"ABC-анализ",
      "description":"Метод квалификации ресурсов по степени их важности. Метод АВС базируется на законе Парето."
    },
    {
      "termin":"XYZ-анализ",
      "description":"Инструмент, который позволяет разделить товар по уровню колебаний спроса, и предназначен для учета неопределенностей, возникающих в логистическом потоке."
    },
    {
      "termin":"Толкающая система",
      "description":"Система организации производственного процесса, в которой материальный поток подается с предыдущей операции на последующую в соответствии с жестко сформированным графиком."
    },
    {
      "termin":"Тянущая система",
      "description":"Система организации производственного процесса, при которой материальный поток подается на следующую технологическую операцию после предыдущей, то есть по мере необходимости."
    },
    {
      "termin":"Уровень канала",
      "description":"Посредник (или посредники), которые выполняют работу по приближению товара и права собственности на него к конечному потребителю."
    },
    {
      "termin":"Дилер",
      "description":"Оптовый посредник, который ведет операции от своего имени и за свой счет."
    },
    {
      "termin":"Дистрибьютор",
      "description":"Оптовый и розничный посредник, ведущий операции от имени производителя и за свой счет."
    },
    {
      "termin":"Комиссионер",
      "description":"Оптовый и розничный посредник, ведущий операции от своего имени и за счет производителя."
    },
    {
      "termin":"Агент",
      "description":"Посредник, выступающий в качестве представителя или помощника другого, основного по отношению к нему лица (принципала)."
    },
    {
      "termin":"Брокер",
      "description":"Посредник при заключении сделок, сводящий контрагентов."
    },
    {
      "termin":"Склады",
      "description":"Здания, сооружения и разнообразные устройства, предназначенные для приемки, размещения и хранения поступивших товаров, подготовки их к потреблению и отпуску потребителю."
    },
    {
      "termin":"Грузовая единица",
      "description":"Некоторое количество грузов, которые погружают, транспортируют, выгружают и хранят как единую массу."
    },
    {
      "termin":"Универсальный грузовой модуль",
      "description":"Куб со сторонами 300 ×х 300 ×х 400 мм."
    },
    {
      "termin":"Поддон (паллет)",
      "description":"Приспособление для механизированной погрузки-выгрузки грузов, сформированных в пакет."
    },
    {
      "termin":"Пакетирование",
      "description":"Операция формирования на поддоне грузовой единицы с последующим связыванием груза и поддона воедино."
    },
    {
      "termin":"Линейные штрих-коды",
      "description":"Коды, читаемые в одном направлении по горизонтали."
    },
    {
      "termin":"Двухмерные штрих-коды",
      "description":"Коды, расшифровка которых проводится в двух направлениях (по горизонтали и вертикали). "
    },
    {
      "termin":"QR-код",
      "description":"Матричный код (двумерный штрих-код), разработанный как одно из средств автоматизации складов и логистики. Такой код содержит в себе данные, зашифрованные как по вертикали, так и по горизонтали."
    },
    {
      "termin":"RFID (Radio Frequency Identification)",
      "description":"Способ автоматической идентификации объектов, в котором посредством радиосигналов считываются или записываются данные, хранящиеся в транспондерах (метках)."
    },
    {
      "termin":"Транспорт",
      "description":"Совокупность путей сообщения и подвижных перевозочных средств, а также различных сооружений и устройств, обеспечивающих их нормальную работу."
    },
    {
      "termin":"Транспортный коридор",
      "description":"Условное обозначение воздушного, наземного или морского пути для движения транспорта по определенному маршруту."
    },
    {
      "termin":"Смешанное сообщение",
      "description":"Перевозка грузов различными или одним и тем же видом транспорта, но с перегрузкой (например, с одного автомобиля в другой) и новым договором перевозки."
    },
    {
      "termin":"Прямое сообщение",
      "description":"Перевозка грузов по одному документу, выполняющему функции договора перевозки, даже если груз перегружался в пути."
    },
    {
      "termin":"Унимодальная перевозка",
      "description":"Перевозка грузов только одним видом транспорта, которая осуществляется преимущественно самим перевозчиком без участия экспедитора."
    },
    {
      "termin":"Мультимодальная перевозка",
      "description":"Перевозка грузов последовательно двумя и более видами транспорта, которая осуществляется преимущественно экспедитором."
    },
    {
      "termin":"«От двери – до двери» («door-to-door»)",
      "description":"Экспедиторские услуги транспортной экспедиции, подразумевающие организацию перевозки грузов от двери склада грузоотправителя до двери склада грузополучателя."
    },
    {
      "termin":"Груз",
      "description":"Товар, находящийся в процессе перевозки."
    },
    {
      "termin":"Удельный объем",
      "description":"Объем, который занимает 1 т груза на подвижном составе (единица измерения м<sup>3</sup>/т)."
    },
    {
      "termin":"Плотность (объемная масса) груза",
      "description":"Отношение массы груза к занимаемому этим грузом объему (единица измерения т/м<sup>3</sup>)."
    },
    {
      "termin":"Масса брутто",
      "description":"Полная масса груза и тары."
    },
    {
      "termin":"Масса нетто",
      "description":"Полная масса груза."
    },
    {
      "termin":"Опасный груз",
      "description":"Груз, который при неправильном обращении может стать причиной ущерба для транспортного средства или имущества, ухудшения здоровья или гибели людей. "
    },
    {
      "termin":"Паллет (поддон)",
      "description":"Приспособление для механизированной погрузки-выгрузки грузов, сформированных в пакет."
    },
    {
      "termin":"ДФЭ (twenty-foot equivalent unit, TEU)",
      "description":"Условная единица учета парка контейнеров и контейнерных перевозок, за которую принят интермодальный контейнер ИСО размерами 20 × 8 × 8 футов (6058 × 2438 × 2438 мм) типа IC."
    },
    {
      "termin":"ЕС-тахограф",
      "description":"Бортовое электронное контрольно-измерительное устройство, устанавливаемое вместо спидометра или совместно с ним, предназначенное для непрерывной индикации и регистрации скорости движения, пробега, периодов труда и отдыха водителя."
    },
    {
      "termin":"Инкотермс (Incoterms International Commercial Terms)",
      "description":"Правила толкования наиболее широко используемых торговых терминов."
    },
    {
      "termin":"Перевозчик",
      "description":"Любое лицо, которое на основании договора перевозки обязуется осуществить или обеспечить перевозку товара по железной дороге, автомобильным, воздушным, морским и внутренним водным транспортом или комбинацией этих видов транспорта."
    },
    {
      "termin":"Терминал",
      "description":"Любое место, закрытое или нет, такое как причал, склад, контейнерный двор или автомобильный, железнодорожный или авиа карго терминал."
    },
    {
      "termin":"Система документооборота",
      "description":"Система описания, структурирования, хранения и навигации документов."
    },
    {
      "termin":"ОКАТО",
      "description":"Общероссийский классификатор объектов административно-территориального деления."
    },
    {
      "termin":"ОКОПФ",
      "description":"Общероссийский классификатор организационно-правовых форм."
    },
    {
      "termin":"ОКФС",
      "description":"Общероссийский классификатор форм собственности."
    },
    {
      "termin":"ОКОГУ",
      "description":"Общероссийский классификатор органов государственного управления."
    },
    {
      "termin":"ОКВЭД",
      "description":"Общероссийский классификатор видов экономической деятельности. "
    },
    {
      "termin":"ИНН",
      "description":"Идентификационный номер налогоплательщика."
    },
    {
      "termin":"КПП",
      "description":"Код причины постановки на учет."
    },
    {
      "termin":"Коносамент",
      "description":"Документ, применяемый при линейном судоходстве. Он выдается судовладельцем грузоотправителю в удостоверение принятия груза к перевозке морским путем на судах регулярных линий."
    },
    {
      "termin":"Чартер (charter), или чартер-партия",
      "description":"Договор на перевозку грузов трамповыми судами. Трамповое судоходство занято в основном нерегулярными перевозками, без определенного расписания."
    },
    {
      "termin":"Речная накладная",
      "description":"Документ, который выдается перевозчиком отправителю груза, перевозимого по реке."
    },
    {
      "termin":"Автодорожная накладная",
      "description":"Транспортный документ, подтверждающий наличие договора между перевозчиком и отправителем об автодорожной перевозке грузов."
    },
    {
      "termin":"Транспортная накладная",
      "description":"Перевозочный документ, подтверждающий заключение договора перевозки груза, в котором определяются условия перевозки груза, фиксируются сведения о стоимости услуг перевозчика и порядке расчета провозной платы."
    },
    {
      "termin":"Авианакладная",
      "description":"Документ, который подтверждает наличие договора между грузоотправителем и перевозчиком о перевозке грузов по авиалиниям перевозчика."
    },
    {
      "termin":"Книжка МДП (Carnet TIR)",
      "description":"Международный таможенный документ, который подтверждает то, что в отношении перевозимых по процедуре МДП товаров существует международная гарантия."
    },
    {
      "termin":"Декларация на товары",
      "description":"Документ по установленной форме, в котором указываются сведения, необходимые для представления в таможенный орган в соответствии со ст. 180 Таможенного Кодекса Таможенного союза."
    },
    {
      "termin":"Декларация таможенной стоимости (ДТС)",
      "description":"Документ, в котором указываются сведения о таможенной стоимости и ее элементах."
    },
    {
      "termin":"Таможенная стоимость товара",
      "description":"Стоимость товара, определенная исходя из международных договоров между участниками Таможенного союза при ввозе товара на таможенную территорию Таможенного союза, а при его вывозе – на основании законодательства страны-участницы Таможенного союза."
    }
  ]
}
